{
  "disciplina": [{
    "id": 0,
    "nome": "Computação e Sociedade",
    "ementa": [
      "História da computação",
      "Estudo e análise de casos de aplicação de computadores na sociedade e para o meio ambiente",
      "Subáreas da computação e áreas interdisciplinares",
      "Importância e desafios da computação no Brasil e no mundo",
      "Cursos de computação e aspectos profissionais: tipos de cursos, perfis profissionais, demanda do mercado,organizações e associações na área, regulamentação da profissão",
      "mercado, organizações e associações na área, regulamentação da profissão",
      "Leis e normas relacionadas à Informática",
      "Questões ambientais, raciais, de saúde e de inclusão digital relacionadas à Computação",
      "Ética na Computação",
      "Empresas de tecnologia da informação",
      "Incubadoras de empresas."
    ],
    "cargaHorariaTotal": 32,
    "cargaHorariaTeorica": 32,
    "cargaHorariaPratica": 0,
    "periodo": 1,
    "obrigatoria": "Sim",
    "preRequisitos": "",
    "nucleo": "NC",
    "bibliografiaBasica": [
      "VELOSO, R. Tecnologias da Informação e Comunicação: Desafios e Perspectivas. São Paulo: Saraiva, 2011",
      "MASIERO, P. Ética em Computação. Editora da USP, 2000",
      "FONSECA FILHO, C. História da computação: O Caminho do Pensamento e da Tecnologia. Porto Alegre: EDIPUCRS, 2007"
    ],
    "bibliografiaComplementar": [
      "CHALITA, G. Os Dez Mandamentos da Ética. Editora Nova Fronteira, 2003",
      "DRUMMOND, V. Internet, Privacidade e Dados Pessoais. Editora Lumen Juris, 2003",
      "KACZMARCZYK, L. C. Computers and Society: Computing for Good. Chapman & Hall/CRC Textbooks in Computing. CRC Press, 2011",
      "LUCCA, N.; FILHO, A. S. Direito & Internet. Editora Edipro, 2001",
      "PAESANI, L. M. Direito de Informática. Editora Atlas, 2005"
    ],
    "swebok": [
      "Software engineering professional practice",
      "Prática profissional em engenharia de software"
    ]
  },
    {
      "id": 1,
      "nome": "Introdução à Programação",
      "ementa": [
        "Introdução a algoritmos",
        "Conceitos básicos de programas: constantes; tipos de dados primitivos; variáveis; atribuição; entrada e saída de dados; expressões; estruturas de decisão; estruturas de repetição",
        "Ponteiro",
        "Estruturas de dados homogêneas e heterogêneas: vetores, matrizes, cadeias de caracteres, registros",
        "Subprogramas: funções; passagens de parâmetros por valor e por referência, recursividade",
        "Manipulação de arquivos: abertura, fechamento, leitura e gravação",
        "Tipos de acesso a arquivos: sequencial e indexado",
        "Tipos de arquivos (texto e binário)",
        "Transcrição de algoritmos para uma linguagem de programação",
        "Domínio de uma linguagem de programação: sintaxe e semântica; interpretação e compilação de programas; ambiente de desenvolvimento de programas; estilo de codificação; documentação de código; técnicas de depuração e técnicas de profiling; desenvolvimento e uso de bibliotecas."
      ],
      "cargaHorariaTotal": 128,
      "cargaHorariaTeorica": 48,
      "cargaHorariaPratica": 80,
      "periodo": 1,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "FOBERLONE, A. L. V.; EBERSPACHER, H. F. Lógica de Programação: A construção de algoritmos e estruturas de dados. 3.a edição. São Paulo: Prentice Hall, 2005",
        "ASCENCIO, A. F. G.; CAMPOS, E. A. V. Fundamentos da Programação de Computadores. 3.a edição. Editora Pearson, 2010",
        "SCHILDT, H. C Completo e Total. 3a Ed.  São Paulo: Makron Books, 1996"
      ],
      "bibliografiaComplementar": [
        "FEOFILOFF, P. Algoritmos em Linguagem C. Editora Campus/Elsevier, 2009",
        "FARRER, H. at al. Programação Estruturada de Computadores: Algoritmos Estruturados. 3.a edição. Rio de Janeiro: LTC, 1989",
        "SEDGEWICK, R. Algorithms in C. 3rd ed. Reading, Mss: Addison-Wesley, 1998.  ISBN 0201314525",
        "SALVETTI, D. D.; BARBOSA, L. M. Algoritmos, São Paulo: Makron Books, 1998",
        "CORMEN, T. H et al., Algoritmos: Teoria e Prática. 2.a edição. Rio de Janeiro: Editora Campus, 2002"
      ],
      "swebok": [
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },
    {
      "id": 2,
      "nome": "Cálculo 1A",
      "ementa": [
        "Números reais",
        "Funções reais de uma variável real e suas inversas",
        "Noções sobre cônicas",
        "Limite e continuidade",
        "Derivadas e aplicações",
        "Integrais",
        "Técnicas de Integração",
        "Integrais impróprias",
        "Polinômio de Taylor",
        "Aplicações."
      ],
      "cargaHorariaTotal": 96,
      "cargaHorariaTeorica": 96,
      "cargaHorariaPratica": 0,
      "periodo": 1,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "GUIDORIZZI, H. L. Um Curso de Cálculo, vol. 1. LTC, Rio de Janeiro, Brasil, 2006",
        "LEITHOLD, L. O Cálculo com Geometria Analítica, 3.a edição. vol. 1. Harbra, São Paulo, 1994",
        "STEWART, J. Cálculo, 5.a edição. vol. 1. Cengage Learning, São Paulo, 2006"
      ],
      "bibliografiaComplementar": [
        "ÁVILA, G. S. S. Cálculo: Funções de Uma Variável, 7.a edição. vol. 1. LTC: Rio de Janeiro, 1994",
        "FLEMMING, D. M.; GONÇALVES, M. B. Cálculo A: Funções, limite, derivação e integração. Makron Books do Brasil, São Paulo, 2006",
        "HOFFMANN, L. D.; BRADLEY, G. L. Cálculo: Um curso moderno com aplicações, 9.a edição. LTC, Rio de Janeiro, 2008",
        "REIS, G. L; SILVA, V. V. Geometria Analítica. LTC, São Paulo",
        "SIMMONS, G. F. Cálculo com Geometria Analítica, vol. 1. McGraw-Hill do Brasil, São Paulo, Brasil, 1987"
      ],
      "swebok": [
        "Mathematicals foundations",
        "Fundamentos matemáticos"
      ]
    },
    {
      "id": 3,
      "nome": "Fundamentos de Matemática para Computação",
      "ementa": [
        "Noções de lógica",
        "Introdução a demonstrações",
        "Indução matemática, Recursividade e Relações de Recorrência, Conjuntos e Combinatória",
        "Séries e sequências",
        "Relações e Funções",
        "Representações numéricas e Mudança de base numérica."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 1,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "GERSTING, J. L. Fundamentos Matemáticos para a Ciência da Computação, 5.a edição, Editora LTC, Rio de Janeiro, 2004",
        "SCHEINERMAN, E. R. Matemática Discreta: Uma introdução, Cengage Learning, Thompson Pioneira, 2003",
        "GRIMALDI, R. P. Discrete and Combinatorial Mathematics: An Applied Introduction, 5th edition, Pearson - Addison-Wesley, Boston, 2003"
      ],
      "bibliografiaComplementar": [
        "MATTSON, Jr.; H. F. Discrete Mathematics with applications, John Wiley & Sons, New York, 1993",
        "ROSEN, K. H. Discrete Mathematics and Its Applications, 6.a edição, Boston: McGraw-Hill, 2009",
        "ROSS, K. A.; Wright, C. R. B. Discrete mathematics, Prentice Hall, 1998",
        "SANTOS, J. P. O. Introdução à Teoria dos Números, Coleção Matemática Universitária, CNPQ-IMPA, Rio de Janeiro, 2003"
      ],
      "swebok": [
        "Mathematicals foundations",
        "Fundamentos matemáticos",
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },
    {
      "id": 4,
      "nome": "Arquitetura de Computadores",
      "ementa": [
        "Visão geral dos computadores modernos",
        "Evolução da arquitetura dos computadores",
        "Memória e representação de dados e instruções",
        "Processador, ciclo de instrução, formato e endereçamento",
        "Noções básicas de programação em linguagem de montagem",
        "Dispositivos de entrada e saída",
        "Sistemas de interconexão (barramentos)",
        "Interfaceamento e técnicas de entrada e saída",
        "Hierarquia de memória",
        "Introdução a arquiteturas paralelas e métricas de desempenho."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 48,
      "cargaHorariaPratica": 16,
      "periodo": 2,
      "obrigatoria": "Sim",
      "preRequisitos": "Fundamentos de Matemática para Computação",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "BRYANT, R.; O'RALLARON, D. Computer Systems: A Programmer's Perspective, 2nd Edition, Addison Wesley, 2010",
        "STALLINGS, W. Arquitetura e Organização de Computadores, 5a. Edição, Prentice-Hall, 2002",
        "TANENBAUM, A. Organização Estruturada de Computadores, Editora LTC, 2006"
      ],
      "bibliografiaComplementar": [
        "HENNESSY, J. L.; PATTERSON, D. A. Computer Architecture: A Quantitative Approach, 4th Edition, Morgan Kaufmann, 2007",
        "MONTEIRO, M. A.  Introdução à Organização de Computadores.  4ª.  Edição. Editora LTC, Rio de Janeiro, 2001. ISBN: 8521612915",
        "PATTERSON, D. A.; HENNESSY, J. L. Computer Organization and Design: The Hardware/Software Interface, 3rd edition, Morgan Kaufmann, 2007",
        "STALLINGS, W. Computer Organization and Architecture: Designing for Performance. 10th Edition. Prentice-Hall, Inc., Upper Saddle River, NJ, USA.  2010",
        "WEBER, R. F. Fundamentos de Arquiteturas de Computadores, 2.a Edição, Editora Sagra-Luzzatto, 2001"
      ],
      "swebok": [
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },
    {
      "id": 5,
      "nome": "Algoritmos e Estruturas de Dados 1",
      "ementa": [
        "Noções de complexidade de algoritmos (notações de complexidade)",
        "Algoritmos de pesquisa: pesquisa sequencial e binária.",
        "Algoritmos de ordenação.",
        "Tipos abstratos de dados.",
        "Estruturas de dados utilizando vetores: pilhas, filas, listas (simples e circulares).",
        "Estruturas de dados com alocação dinâmica de memória: pilhas, filas, listas (simplesmente encadeadas, duplamente encadeadas e circulares)."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 32,
      "cargaHorariaPratica": 32,
      "periodo": 2,
      "obrigatoria": "Sim",
      "preRequisitos": "Introdução a Programação",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "FEOFILOFF, P. Algoritmos em Linguagem C. Editora Campus/Elsevier, 2009",
        "SZWARCFITER, J. L.; MARKENZON, L. Estruturas de Dados e seus Algoritmos. 2ª edição, LTC, 1994",
        "TENENBAUM, A. M.; LANGSAM, Y.; AUGENSTEIN, M. Estruturas de Dados Usando C, São Paulo, Makron Books, 1995"
      ],
      "bibliografiaComplementar": [
        "CORMEN, T. H. et al., Algoritmos: Teoria e Prática. 2.ª edição, Rio de Janeiro: Editora Campus, 2002",
        "SALVETTI, D. D.; BARBOSA, L. M.; Algoritmos, Makron Books, São Paulo, 1998",
        "SEDGEWICK, R. Algorithms in C++ (Parts 1-4), Addison-Wesley, 3rd Edition, 1998",
        "ZIVIANI, N. Projeto de Algoritmos com implementação em Pascal e C. São Paulo: Editora Thomson, 3.ª edição, 2010",
        "ZIVIANI, N. Projeto de Algoritmos com implementação em Java e C++. São Paulo: Editora Thomson, 2006"
      ],
      "swebok": [
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },
    {
      "id": 6,
      "nome": "Probabilidade e Estatística A",
      "ementa": [
        "Estatística descritiva",
        "Noções sobre amostragem",
        "Introdução à teoria de conjuntos",
        "Introdução à teoria de probabilidade: espaço amostral, eventos, frequência relativa, fundamentos de probabilidade, probabilidade condicional, eventos independentes e teorema de Bayes",
        "Variáveis aleatórias: conceitos básicos, esperança e variância",
        "Distribuições discretas de probabilidade: uniforme, binomial e Poisson",
        "Distribuições contínuas de probabilidade: uniforme, exponencial, normal e t-Student",
        "Estimação pontual e intervalar para uma população: média e proporção.Teste de hipóteses para uma população: média e proporção",
        "Correlação linear e regressão linear simples."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 2,
      "obrigatoria": "Sim",
      "preRequisitos": "Cálculo 1A",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "MAGALHÃES, M. N. Noções de Probabilidade e Estatística. São Paulo: EDUSP, 7.a ed., 2010",
        "MEYER, P. L. Probabilidade: Aplicações à Estatística. Rio de Janeiro: LTC, 1969",
        "WALPOLE, R. E.; MYERS, R. H.; MYERS, S. L.; YE, K. Probabilidade e Estatística para Engenharia e Ciências. São Paulo: Pearson, 8.a ed., 2009"
      ],
      "bibliografiaComplementar": [
        "BUSSAB, W. O.; MORETTIN, P. A. Estatística Básica. 6.a ed. São Paulo: Saraiva, 2010",
        "DANTAS, C. A. B. Probabilidade: um Curso Introdutório. 3.a ed. São Paulo: EDUSP, 2008",
        "MORETTIN, L. G. Estatística básica: probabilidade e inferência. São Paulo: Prentice Hall, 2010",
        "ROSS, S. Probabilidade. Um Curso Moderno com Aplicações. 8.a ed. Porto Alegre: Bookman, 2010",
        "TRIOLA, M. F. Introdução à Estatística. 10. ed. Rio de Janeiro: LTC, 2008"
      ],
      "swebok": []
    },
    {
      "id": 7,
      "nome": "Álgebra Linear",
      "ementa": [
        "Sistemas lineares e matrizes",
        "Espaços vetoriais",
        "Transformações lineares",
        "Autovalores e autovetores.Espaços com produto interno."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 2,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "BOLDRINI, J. L.; COSTA, S. I. R; FIGUEIREDO, V. L; WETZLER, H. G. Álgebra Linear, 3.a ed. Harbra, São Paulo, 2003",
        "CALLIOLI, C. A.; DOMINGUES, H. H; COSTA, R. C. F. Álgebra Linear e Aplicações. Atual, Brasil, 1983",
        "LIPSCHUTZ, S. Álgebra Linear, 2.a ed. Makrom-Books, São Paulo, Brasil, 1974"
      ],
      "bibliografiaComplementar": [
        "APOSTOL, T. Linear Algebra: A First Course with Applications to Differential Equations, 1st ed. Wiley-Interscience, 1997",
        "HOFFMAN, K.; KUNZE, R. Álgebra Linear. Polígono, São Paulo, 1971",
        "HOWARD, A.; RORRES, C. Álgebra Linear com Aplicações, 8.a ed. Bookman, Porto Alegre, Brasil, 2001",
        "LIMA, E. L. Álgebra Linear: Coleção Matemática Universitária. IMPA, Rio de Janeiro, Brasil, 2006",
        "SHOKRANIAN, S. Introdução à Álgebra Linear e Aplicações, 1 ed. UNB, 2004"
      ],
      "swebok": []
    },
    {
      "id": 8,
      "nome": "Lógica Matemática",
      "ementa": [
        "Noções básicas: linguagem natural vs linguagens formais; verdade, validade, satisfatibilidade; lógica proposicional (sintaxe e semântica, propriedades e relações semânticas, consequência lógica, simplificação de fórmulas); lógica de primeira ordem (sintaxe e semântica, propriedades e relações semânticas, formas normais);",
        "Métodos de validação: métodos diretos de prova; métodos de prova por contradição; indução estrutural.",
        "Linguagem para experimentação.",
        "Aplicações básicas."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 2,
      "obrigatoria": "Sim",
      "preRequisitos": "Fundamentos da Matemática para Computação",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "SOUZA, J. N. Lógica para Ciência da Computação. Editora Campus, 3.a Edição, 2015",
        "SILVA, F. C.; FINGER, M.; MELO, A. C. V. Lógica para Computação. Thomson Learning, 2006",
        "HUTH, M.; RYAN, M. Lógica em Ciência da Computação: modelagem e argumentação sobre sistemas. 2.a edição. Editora LTC, 2008"
      ],
      "bibliografiaComplementar": [
        "MORTARI, C. Introdução à Lógica. São Paulo: UNESP. 2001",
        "MENDELSON, E. Introduction to Mathematical Logic, Academic Press, 2000",
        "ENDERTON, H. A. Mathematical Introduction to Logic. Academic Press 2000",
        "SMULLYAN, R. Lógica de Primeira Ordem. São Paulo: UNESP. 2009",
        "CASANOVA, M. A.; GIORNO, F. A. C.; FURTADO, A. L. Programação em Lógica e a Linguagem PROLOG. Edgard Blucher, 1987"
      ],
      "swebok": []
    },
    {
      "id": 9,
      "nome": "Programação Orientada a Objetos",
      "ementa": [
        "Abstração e tipos abstratos de dados.Classes, métodos, encapsulamento, interface",
        "Mensagens, instâncias e inicialização",
        "Herança e composição.Polimorfismo.Uso de uma linguagem orientada a objetos.Noções de UML.Noções de padrões de projeto orientado a objetos"
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 32,
      "cargaHorariaPratica": 32,
      "periodo": 3,
      "obrigatoria": "Sim",
      "preRequisitos": "Introdução a Programação",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "BORATTI, I. C. Programação orientada a objetos em Java. 1.a Edição. Visual Books, 2007",
        "ECKEL, B. Thinking in Java. Prentice Hall, 3.a Edição, 2002",
        "DEITEL, P. J.; DEITEL, H. M. Java: como programar 6.a ed. São Paulo: Prentice Hall, 2005. 1386 p."
      ],
      "bibliografiaComplementar": [
        "BUDD, T. An Introduction to Object-Oriented Programming. Addison Wesley, 1996",
        "GAMMA, E. et al. Design patterns: elements of reusable object-oriented software. Reading: Addison Wesley, 1995",
        "HORSTMANN, C. S. Core Java – Volume II – Advanced Features, Prentice Hall, 8.a Edição, 2008",
        "SANTOS, R. Introdução à Programação Orientada a Objetos com Java. Campus, 2003",
        "ZEIGLER, B. P. Objects and Systems: Principled Design with Implementations in C++ and Java. Springer-Verlag New York, Inc., New York, NY, USA. 1997"
      ],
      "swebok": []
    },
    {
      "id": 10,
      "nome": "Algoritmos e Estruturas de Dados 2",
      "ementa": [
        "Árvores: formas de representação, recursão em árvores, árvores binárias, árvores binárias de busca, árvores balanceadas (AVL e rubro-negras).",
        "Filas de prioridades",
        "Heaps, Heapsort",
        "Hashing: tipos de funções de hashing; tratamento de colisões.Definições de Grafos.",
        "Estruturas de Dados para representação de grafos.Algoritmos básicos em grafos."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 3,
      "obrigatoria": "Sim",
      "preRequisitos": "Algoritmos e Estruturas de Dados 1",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "FEOFILOFF, P. Algoritmos em Linguagem C. Editora Campus/Elsevier, 2009",
        "SZWARCFITER, J. L.; Markenzon, L. Estruturas de Dados e seus Algoritmos. 2ª edição, LTC, 1994",
        "TENENBAUM, A. M.; LANGSAM, Y.; AUGENSTEIN, M. Estruturas de Dados Usando C, São Paulo, Makron Books, 1995"
      ],
      "bibliografiaComplementar": [
        "CORMEN, T. H. et al., Algoritmos: Teoria e Prática. 2ª edição, Rio de Janeiro: Editora Campus, 2002",
        "SALVETTI, D. D. e BARBOSA, L. M., Algoritmos, Makron Books, São Paulo, 1998",
        "SEDGEWICK, R. Algorithms in C++ (Parts 1-4), 3rd edition, Addison-Wesley, 1998",
        "ZIVIANI, N. Projeto de Algoritmos com implementação em Pascal e C. 3ª edição, São Paulo: Editora Thomson, 2010",
        "ZIVIANI, N. Projeto de Algoritmos com implementação em Java e C++. São Paulo: Editora Thomson, 2006"
      ],
      "swebok": [
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },
    {
      "id": 11,
      "nome": "Optativa 1",
      "ementa": [""],
      "cargaHorariaTotal": "",
      "cargaHorariaTeorica": "",
      "cargaHorariaPratica": "",
      "periodo": "",
      "obrigatoria": "",
      "preRequisitos": "",
      "nucleo": "",
      "bibliografiaBasica": [
        "",
        "",
        ""
      ],
      "bibliografiaComplementar": [
        "",
        "",
        "",
        "",
        ""
      ],
      "swebok": []
    },

    {
      "id": 12,
      "nome": "Linguagens e Paradigmas de Programação",
      "ementa": [
        "Estudo dos conceitos de linguagens de programação e dos paradigmas de programação: procedural, funcional, lógico, orientado a objeto e script.",
        "Reflexão sobre as características desejáveis em uma linguagem de programação e os critérios de seleção de linguagens de acordo com as especificidades dos domínios de aplicação.",
        "Descrição de sintaxe e semântica.",
        "Estudo sobre tipos de dados, estruturas de controle, ambientes de execução, variáveis, expressões e subprogramas em linguagens de programação."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 32,
      "cargaHorariaPratica": 32,
      "periodo": 3,
      "obrigatoria": "Sim",
      "preRequisitos": "Introdução à Programação",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "GHEZZI, C.; JAZYERI, M. Programming Language Concepts, 3rd Edition, Wiley; 3rd Edition; 1997",
        "SCOTT, M. L. S. Programming Language Pragmatics, 3rd Edition, Morgan Kaufmann, 2009",
        "SEBESTA, R. W. Concepts of Programming Languages; 10th Edition, Pearson, 2012"
      ],
      "bibliografiaComplementar": [
        "FRIEDMAN, D. P.; WAND, M. Essentials of Programming Languages, 3rd Edition, The MIT Press, 2008",
        "PRATT, T. W.; ZELKOWITZ, M. V. Programming Languages: Design and Implementation, 4th Edition, Prentice Hall, 2000",
        "ROY, P. V.; HARIFI, S. Concepts, Techniques, and Models of Computer Programming, 1st Edition, The MIT Press, 2004",
        "TURBAK, F.; GIFFORD, D. Design Concepts in Programming Languages, 1st Edition, The MIT Press, 2008",
        "VAREJÃO, F. Linguagens de Programação, 1.a Edição, Editora. Campus, 2004"
      ],
      "swebok": [
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },

    {
      "id": 13,
      "nome": "Engenharia de Software",
      "ementa": [
        "Requisitos de software.",
        "Projeto (design) de software.",
        "Construção de software.",
        "Teste de software.",
        "Manutenção de software.",
        "Gerência de configuração de software.",
        "Gerência de projeto de software.",
        "Processo de engenharia de software.",
        "Modelos e métodos de engenharia de software.",
        "Qualidade de software.",
        "Prática profissional de engenharia de software.",
        "Economia para engenharia de software.",
        "Fundamentos de engenharia."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 3,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "PRESSMAN, R.; MAXIM, B. Software Engineering: A Practitioner’s Approach, 8th edition, McGraw-Hill, 2014",
        "SOMMERVILLE, I. Software Engineering, 10th Edition, Pearson, 2016",
        "WAZLAWICK, R. S. Engenharia de software: teoria e prática. Campus, 2013"
      ],
      "bibliografiaComplementar": [
        "ISO/IEC/IEEE 24765. Systems and software engineering - Vocabulary, 2010. Portal de periódicos da CAPES (http://goo.gl/FrGm7c).",
        "MAGELA, R. Engenharia de software aplicada. Alta Books, 2006",
        "MPS.BR.  Melhoria de Processos do Software Brasileiro. Disponível em http://www.softex.br/mpsbr/, último acesso julho/2016",
        "Software Engineering Body of Knowledge (SWEBOK), V3, IEEE, Disponível em https://www.computer.org/web/swebok",
        "Software Engineering Competency Model (SWECOM), IEEE. Disponível em https://www.computer.org/web/peb/swecom"
      ],
      "swebok": [
        "Software testing",
        "Teste de software",
        "Software Engineering Managment",
        "Gerencia de engenharia de software",
        "Software configuration management",
        "Gerencia de configuraço de software",
        "software engineering processo",
        "processo de software",
        "software engineering models and methods",
        "métodos e modelos de engenharia de software",
        "software quality",
        "qualidade de software",
        "software engineering professional practice",
        "prática profissional em engenharia de software",
        "software engineering economics",
        "economia em engenharia de software",
        "software requirements",
        "requisitos de software",
        "software design",
        "projeto de software",
        "software construction",
        "construção de software",
        "software maintenance",
        "manutenção de software"
      ]
    },
    {
      "id": 14,
      "nome": "Análise e Projeto de Algoritmos",
      "ementa": [
        "Medidas de complexidade, análise assintótica de limites de complexidade para algoritmos iterativos e recursivos, técnicas de prova de cotas inferiores.",
        "Corretude de Algoritmos.",
        "Exemplos de análise de algoritmos.",
        "Técnicas de projeto de algoritmos: dividir para conquistar, programação dinâmica, algoritmos gulosos.",
        "Introdução à NP-Completude."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 4,
      "obrigatoria": "Sim",
      "preRequisitos": [
        "Fundamentos de Matemática para Computação",
        "Algoritmos e Estruturas de Dados 2"
      ],
      "nucleo": "NC",
      "bibliografiaBasica": [
        "BRASSARD, G.; BRATLEY, P. Fundamentals of Algorithmics. Prentice-Hall, Inc., Upper Saddle River, NJ, 1996. ISBN: 0-13-335068-1",
        "CORMEN, T. H.; LEISERSON, C. E.; RIVEST, R. L.; STEIN,  C. Algoritmos: Teoria e Prática, 3.a edição, Campus, 2012",
        "PAPADIMITRIOU, C. H.; VAZIRANI, U. V.; DASGUPTA, S. Algoritmos. 2009. McGraw-Hill Brasil. ISBN 9788577260324"
      ],
      "bibliografiaComplementar": [
        "AHO, A. V.; HOPCROFT, J. E.; ULLMAN, J. D. The Design and Analysis of Computer Algorithms, Addison-Wesley Publishing Company, 1974. ISBN 0-201-00029-6",
        "BAASE, S.; GELDER, A. V. Computer Algorithms: Introduction to Design and Analysis, 3rd Edition, Pearson, 1999",
        "MAMBER, U. Introduction to Algorithms. Addison Wesley Publishing Company. 1989",
        "SEDGEWICK, R.; WAYNE, K. Algorithms. 4th edition, Addison-Wesley Professional, 2011. ISBN: 978-0321573513",
        "SZWARCFITER, J. L.; MARKENZON, L. Estrutura de Dados e seus Algoritmos. 3.a edição, LTC Editora, 2010. ISBN 978852161750"
      ],
      "swebok": [
        "Mathematicals foundations",
        "fundamentos matemáticos",
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },
    {
      "id": 15,
      "nome": "Interação Humano-Computador",
      "ementa": [
        "Aspectos gerais sobre interação humano-computador",
        "Características humanísticas e biológicas, envolvendo questões sobre genealogia, gênero, aspectos étnicos, raciais e culturais, direitos e aspectos políticos, deficiências, limitações e capacidades, dentre outros",
        "Ciclo da interação e principais problemas. Metas de usabilidade e experiência do usuário",
        "Fatores humanos em software interativo: teoria, princípios e regras básicas. Modelos conceituais e metáforas",
        "Estilos de interação. Elementos de interação (menus, formulários, manipulação direta e outros). Voz, linguagem natural, sons, páginas Web. Padrões para interface",
        "Localização e internacionalização.",
        "Princípios de projeto de interfaces humano-computador. Métodos de projeto de interação. Projeto visual (cores, ícones, fontes e outros). Tempo de resposta e retroalimentação.",
        "Dispositivos de interação.",
        "Métodos de avaliação de interfaces: avaliação heurística, abordagens para testes realizados com apoio de usuários, técnicas de testes para páginas Web, entre outros",
        "Visão geral de ferramentas de desenvolvimento de interfaces humano-computador."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 32,
      "cargaHorariaPratica": 32,
      "periodo": 4,
      "obrigatoria": "Sim",
      "preRequisitos": [
        "Algoritmos e Estruturas de Dados 1",
        "Probabilidade e Estatística A"
      ],
      "nucleo": "NC",
      "bibliografiaBasica": [
        "DIX, A.; FINLAY, J. E.; ABOWD, G. D.; BEALE, R. Human­Computer Interaction (3rd Edition). Prentice­Hall, Inc., Upper Saddle River, NJ, USA, 2003",
        "ROGERS, Y.; SHARP, H.; PREECE, J. Design de Interação ­ Além da Interação Homem­computador. 3a Ed., Porto Alegre: Bookman, 2013",
        "TIDWELL, J. Designing Interfaces: Patterns for Effective Interaction Design. O’Reilly. Segunda edição, 2011"
      ],
      "bibliografiaComplementar": [
        "BARBOSA, S. D. J.; SILVA, B. S. Interação Humano­Computador. Elsevier Editora. 1.a edição. 2010",
        "JACKO, Julie A. The human­computer interaction handbook: fundamentals, evolving technologies, and emerging applications. CRC Press, 2012",
        "LAZAR, J.; FENG, J. H.; HOCHHEISER, H. Research Methods in Human­Computer Interaction. Wiley, 2009",
        "MACKENZIE, I. S. Human­computer Interaction: An Empirical Research Perspective. Morgan Kaufmann, 201 3. ISBN: 978­0­1 2­405865­1",
        "SCOTT, B.; NEIL, T. Designing Web Interfaces: Principles and Patterns for Rich Interactions. O'Reilly Media; 1st edition. 2009"
      ],
      "swebok": [
        "Software testing",
        "teste de software",
        "software design",
        "projeto de software"
      ]
    },
    {
      "id": 16,
      "nome": "Optativa 2",
      "ementa": [""],
      "cargaHorariaTotal": "",
      "cargaHorariaTeorica": "",
      "cargaHorariaPratica": "",
      "periodo": "",
      "obrigatoria": "",
      "preRequisitos": "",
      "nucleo": "",
      "bibliografiaBasica": [
        "",
        "",
        ""
      ],
      "bibliografiaComplementar": [
        "",
        "",
        "",
        "",
        ""
      ],
      "swebok": []
    },
    {
      "id": 17,
      "nome": "Banco de Dados",
      "ementa": [
        "Conceitos básicos de Banco de Dados",
        "Modelo relacional",
        "Linguagens para Banco de Dados: álgebra relacional, cálculo relacional e SQL",
        "Modelo Entidade-Relacionamento e extensões",
        "Mapeamento ER-relacional",
        "Normalização."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 48,
      "cargaHorariaPratica": 16,
      "periodo": 4,
      "obrigatoria": "Sim",
      "preRequisitos": "Lógica Matemática",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "ELMASRI, R.; NAVATHE, S. B. Sistemas de Banco de Dados, 6.ª ed., Pearson - Addison Wesley, 2011",
        "HEUSER, C. A. Projeto de Banco de Dados, 6.ª edição, Bookman, Porto Alegre, 2009",
        "SILBERSCHATZ, A.; KORTH, H. F.; SUDARSHAN, S. Sistema de Banco de Dados, 5.ª edição, Editora Campus, Rio de Janeiro, 2006"
      ],
      "bibliografiaComplementar": [
        "CONNOLLY, T. M.; BEGG, C. E.; STRACHAN, A. D. Database systems: a practical approach to design, implementation and management, 3rd. Edition, Addison Wesley, 2010",
        "DATE, C. J. Introdução a Sistemas de Banco de Dados, tradução da 8.a edição americana, Editora Campus, Rio de Janeiro, 2004",
        "GARCIA-MOLINA, H.; ULLMAN, J. D.; WIDOM, J. D. Database Systems: The Complete Book, 2.a edição, Prentice Hall, 2009",
        "RAMAKRISHNAN, R.; GEHRKE, J. Sistemas de Gerenciamento de Banco de Dados, tradução da 3.a edição, São Paulo, McGraw-Hill, 2008",
        "TEOREY, T.; LIGHTSTONE, S.; NADEAU, T. Projeto e Modelagem de Bancos de Dados, Editora Campus, Rio de Janeiro, 2007"
      ],
      "swebok": [
        "software design",
        "projeto de software",
        "computing foundations",
        "fundamentos da computação"
      ]
    },
    {
      "id": 18,
      "nome": "Projeto de Software",
      "ementa": [
        "Fundamentos de design de software",
        "Questões básicas de design de software: concorrência, controle e tratamento de eventos, persistência de dados, distribuição, tratamento de erro e exceção, tolerância a falhas, interação e apresentação, e segurança",
        "Estrutura e arquitetura de software",
        "Projeto de interface de usuário",
        "Análise de qualidade e avaliação de design de software",
        "Notação de design de software",
        "Métodos e estratégias de design de software",
        "Ferramentas de design de software."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 4,
      "obrigatoria": "Sim",
      "preRequisitos": [
        "Programação Orientada a Objetos",
        "Engenharia de Software"
      ],
      "nucleo": "NC",
      "bibliografiaBasica": [
        "BASS, L.; CLEMENTS, P.; KAZMAN, R. Software Architecture in Practice, 3rd edition, Pearson Education, Inc., 2013",
        "CLEMENTS, P.; et al. Documenting Software Architectures: Views and Beyond. 2nd edition, Pearson Eduction, 2011",
        "MENDES, A. Arquitetura de software: desenvolvimento orientado para arquitetura. Rio de Janeiro: Campus, 2002. ISBN 853521013X"
      ],
      "bibliografiaComplementar": [
        "CERVANTES, H.; KAZMAN, R. Designing Software Archtectures: A Practical Approach, ISBN-13: 978-0134390789, Addison-Wesley, 2016",
        "PUTMAN, J. Architecting with RM-ODP. Prentice Hall, 2001. ISBN 0130191167",
        "HEINEMAN, G. T.; COUNCILL, W. T. Component-based software engineering: putting the pieces together. Addison-Wesley, 2001. ISBN 0201704854",
        "BOSCH, J. Design and use of software architectures: adopting and evolving a product-line approach. Addison-Wesley, 2000. ISBN 0201674947",
        "JOHNSON, R. Expert one-on-one J2EE development without EJB. Wiley Publishing, 2004. ISBN 0764558315"
      ],
      "swebok": [
        "software design",
        "projeto de software"
      ]
    },
    {
      "id": 19,
      "nome": "Sistemas Operacionais",
      "ementa": [
        "Conceitos de Hardware e Software",
        "Tipos de Sistemas Operacionais",
        "Organização da Estrutura Interna do Sistema Operacional",
        "Gerência de Processos",
        "Gerência do Processador",
        "Gerência de Memória",
        "Gerência de Dispositivos de Entrada e Saída",
        "Sistemas de Arquivos",
        "Estudos de casos de sistemas operacionais atuais"
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 10,
      "obrigatoria": "Sim",
      "preRequisitos": "Arquitetura de Computadores",
      "nucleo": "NE",
      "bibliografiaBasica": [
        "OLIVEIRA, R. S.; CARISSIMI, A. S.; TOSCANI, S. S. Sistemas Operacionais. 3.a edição. Porto Alegre: Instituto de Informática da UFRGS: Editora Sagra Luzzatto, 2004",
        "SILBERSCHATZ, A. Fundamentos de Sistemas Operacionais, 8.a edição, LTC, 2011",
        "TANEMBAUM, A. S. Sistemas Operacionais Modernos. 3.a edição. São Paulo: Editora Prentice Hall, 2010. ISBN 9788576052371"
      ],
      "bibliografiaComplementar": [
        "DEITEL, H. Sistemas Operacionais, Prentice Hall, 2005",
        "MACHADO, F. B. Arquitetura de Sistemas Operacionais. 2.a edição. LTC, 1997",
        "NEMETH E.; SNYDER, G.; HEIN, T. R. Unix system administration handbook. Pearson Prentice Hall, 1997. ISBN 9788576051121",
        "O'GORMAN, J. Operating Systems with Linux. Palgrave, 2001",
        "SHAY, W. Sistemas Operacionais, Makron Books, 1996"
      ],
      "swebok": [
        "Computing foundations",
        "fundamentos da computação"
      ]
    },
    {
      "id": 20,
      "nome": "Pesquisa Operacional",
      "ementa": [
        "Modelagem",
        "Problema de Programação Linear (PL)",
        "Resolução gráfica de PL",
        "Algoritmo Simplex",
        "Dualidade",
        "Algoritmo Simplex-Dual",
        "Pós-otimização e Análise de Sensibilidade."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 10,
      "obrigatoria": "Sim",
      "preRequisitos": "Álgebra Linear",
      "nucleo": "NE",
      "bibliografiaBasica": [
        "BREGALDA, P. F.; OLIVEIRA, A. A. F.; BORNSTEIN, C. T. Introdução à programação linear. 3. ed. Rio de Janeiro: Campus, 1983",
        "GOLBARG, M.; LUNA, H. Otimização combinatória e programação linear. 2. ed. Campus, 2005",
        "TAHA, H. Pesquisa operacional. 8. ed. Prentice Hall, 2008"
      ],
      "bibliografiaComplementar": [
        "BAZARAA M. S.; JARVIS, J. J.; SHERALI, H. D. Linear programming and network Flows.  Wiley, 2009",
        "HILLIER, F. S.; LIEBERMAN, G. J. Introdução à pesquisa operacional. 9.a edição. Amgh Editora, 2013",
        "PARLAR, M. Interactive operations research with Maple: methods and models. Birkhauser, 2000",
        "SILVA, E. M. et al. Pesquisa Operacional: programação linear, simulação. 3.a ed. Atlas, 1998",
        "WINSTON, W. L. Operations research applications and algorithms. 3rd ed. Duxbury Press, 1997"
      ],
      "swebok": [
        "Computing foundations",
        "fundamentos da computação"
      ]
    },
    {
      "id": 21,
      "nome": "Linguagens Formais e Autômatos",
      "ementa": [
        "Conceitos básicos de linguagens",
        "Mecanismos geradores (gramáticas) e reconhecedores (determinísticos e não determinísticos) de linguagens regulares, livres de contexto e sensíveis ao contexto; relação entre estas classes de linguagens e suas principais propriedades",
        "Hierarquia de Chomsky"
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 10,
      "obrigatoria": "Sim",
      "preRequisitos": "Fundamentos de Matemática para Computação",
      "nucleo": "NE",
      "bibliografiaBasica": [
        "SUDKAMP, T. A. Languages and machines. 3.a edição. Addison Wesley, 2006",
        "SIPSER, M. Introduction to the theory of computation. ITP, 1997. ISBN 053494728X",
        "HOPCROFT, J. E.; MOTWANI, R.; ULLMAN, J. D. Introdução à teoria de autômatos: linguagens e computação. Campus, 2002"
      ],
      "bibliografiaComplementar": [
        "RAMOS, M. V. M.; NETO, J. J.; VEGA, I. S. Linguagens formais: teoria, modelagem e implementação. Bookman, 2009",
        "CARROLL, J.; LONG, D. Theory of finite automata. New Jersey: Prentice-Hall International Editions, 1989",
        "LEWIS, H. R.; PAPADIMITRIOU, C. H. Elementos de teoria da computação. 2.a edição. Porto Alegre: Bookman, 2000",
        "MENEZES, P. F. B. Linguagens formais e autônomos. 5.a edição. Porto Alegre: Sagra Luzzatto, 2005",
        "ROSEN, K. H. Matemática discreta e suas aplicações. 6.a ed. Rio de Janeiro: McGraw Hill, 2009"
      ],
      "swebok": [
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },
    {
      "id": 22,
      "nome": "Redes de computadores",
      "ementa": [
        "Fundamentos",
        "Arquitetura de Redes TCP/IP (Internet)",
        "Camadas de Aplicação, Transporte, Rede, Enlace e Física",
        "Gerenciamento de Redes",
        "Redes Sem Fio e Mobilidade",
        "Estudo de Caso de Tópicos Emergentes em Redes."
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 32,
      "cargaHorariaPratica": 32,
      "periodo": 10,
      "obrigatoria": "Sim",
      "preRequisitos": "Sistemas Operacionais",
      "nucleo": "NE",
      "bibliografiaBasica": [
        "KUROSE, J.F.; ROSS, K. Redes de Computadores e a Internet, 6.a edição. Pearson Education, 2013",
        "LAUDON, K. C.; LAUDON, J. P. Sistemas de Informação Gerenciais. 9.a edição. São Paulo: Pearson Education, 2013",
        "TANENBAUM, A. S. Computer Networks, 4th edition, Prentice Hall, 2003"
      ],
      "bibliografiaComplementar": [
        "DANTAS, M. Redes de comunicação e computadores: abordagem quantitativa. Visual Books, 2009. ISBN 9788575022559",
        "PETERSON, L. L.; DAVIE, B. S. Redes de Computadores: Uma Abordagem de Sistemas, 3.a edição. Campus Elsevier, 2004",
        "SOARES, L. F. G; SOUZA FILHO, G. L.; COLCHER, S. Redes de computadores: das LANS, MANS e WANS às Redes ATM. Editora Campus, 1995. ISBN 857001998X",
        "STALLINGS, W. Data and Computer Communications, 8th edition, Pearson/Prentice Hall, 2007",
        "TORRES, G. Redes de computadores: curso completo. Axcel Books, 2001"
      ],
      "swebok": [
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },
    {
      "id": 23,
      "nome": "Introdução à Língua Brasileira de Sinais",
      "ementa": [
        "Introdução às práticas de compreensão e produção em LIBRAS através do uso de estruturas e funções comunicativas elementares",
        "Concepções sobre a Língua de Sinais",
        "O surdo e a sociedade"
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 10,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NE",
      "bibliografiaBasica": [
        "FELIPE, T.; MONTEIRO, M. S. LIBRAS em contexto. Curso Básico. Brasília: Ministério da Educação e do Desporto/Secretaria de Educação Especial, 2001",
        "PEREIRA, M. C. C.; et al. LIBRAS – Conhecimento além dos sinais. São Paulo: Pearson, 2011",
        "PIMENTA, N.; QUADROS, R. M. Curso de LIBRAS 1 – Iniciante. 3.a edição. Porto Alegre: Pallotti, 2008"
      ],
      "bibliografiaComplementar": [
        "ALMEIDA, E. C.; DUARTE, P. M. Atividades ilustradas em sinais da Libras. São Paulo: Revinter, 2004",
        "BRITO, L. F. Por uma gramática de língua de sinais. Rio de Janeiro: Tempo Brasileiro, 1995",
        "CAPOVILLA, F. C.; RAPHAEL, W. D.; MAURÍCIO, A. C. L. Dicionário Enciclopédico Ilustrado Trilíngue da Língua de Sinais Brasileira, v 1 e 2. São Paulo: Editora da Universidade de São Paulo, 2010",
        "CAPOVILLA, F. C.; RAPHAEL, W. D. (ed.). Enciclopédia da Língua de Sinais Brasileira. v. 1 e 2. São Paulo: EDUSP, 2004",
        "GESSER, A. LIBRAS? Que língua é essa?: Crenças e preconceitos em torno da língua de sinais e da realidade surda. São Paulo: Parábola Editorial, 2009",
        "QUADROS, R. M.; KARNOPP, L. Língua de sinais brasileira: estudos linguísticos. ARTMED: Porto Alegre, 2004"
      ],
      "swebok": [
        "Software engineering professional practice",
        "prática profissional em engenharia de software"
      ]
    },
    {
      "id": 24,
      "nome": "Compiladores",
      "ementa": [
        "A estrutura de um compilador",
        "Análises léxica e sintática",
        "Definições dirigidas por sintaxe e análise semântica",
        "Organização da tabela de símbolos",
        "Representação intermediária do programa-fonte",
        "Geração do código-objeto da compilação",
        "Introdução à otimização do código-objeto",
        "Implementação de um compilador"
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 64,
      "cargaHorariaPratica": 0,
      "periodo": 10,
      "obrigatoria": "Sim",
      "preRequisitos": [
        "Algoritmos e Estruturas de Dados 2",
        "Linguagens Formais e Autômatos"
      ],
      "nucleo": "NE",
      "bibliografiaBasica": [
        "AHO, A. V; LAM, M. S.; SETHI, R.; ULLMAN, J. D. Compiladores: Princípios, técnicas e ferramentas. 2.a ed. Pearson-Addison-Wesley, 2008",
        "LOUDEN, K. C. Compiladores - Princípios e Práticas. Editora Thompson 2004",
        "APPEL, A. W. Modern Compiler Implementation in C - Basic Techiniques. Cambridge University Press, 1997"
      ],
      "bibliografiaComplementar": [
        "APPEL, A. W. Modern Compiler Implementation in Java. 2nd edition. New York: Cambridge University Press, 2002",
        "HOLMES, J. Modern Compiler Implementation in Java. Prentice Hall, 1995",
        "MUCHNICK, S. S. Advanced Compiler Design and Implementation. Morgan Kaufmann, 1997",
        "HANSON, D. R.; FRASER, C. W. A Retargetable C Compiler: Design and Implementation. Benjamin Cummings Pub., 1995",
        "LEBLANC, R. J.; FISCHER, C. N. Crafting a Compiler with C.  Benjamin/Cummings, 1991"
      ],
      "swebok": [
        "Computing foundations",
        "Fundamentos da computação"
      ]
    },
    {
      "id": 25,
      "nome": "Sistemas Distribuídos",
      "ementa": [
        "Introdução a Sistemas Distribuídos",
        "Invocação Remota",
        "Objetos Distribuídos",
        "Arquiteturas Orientadas a Serviços e utilização de serviços Web",
        "Computação Móvel e Ubíqua",
        "Estudo de Casos de Tópicos Emergentes em Sistemas Distribuídos"
      ],
      "cargaHorariaTotal": 64,
      "cargaHorariaTeorica": 32,
      "cargaHorariaPratica": 32,
      "periodo": 10,
      "obrigatoria": "Sim",
      "preRequisitos": "Programação Orientada a Objetos",
      "nucleo": "NE",
      "bibliografiaBasica": [
        "ANDREWS, G. R. Foundations of multithreaded, parallel, and distributed programming. Addison-Wesley, 2000",
        "COULOURIS, G. F. et al. Distributed Systems: Concepts and Design, 5th edition, Addison-Wesley, 2012",
        "KUROSE, J. F.; ROSS, K. Redes de Computadores e a Internet, 6.a edição. Pearson Education, 2013"
      ],
      "bibliografiaComplementar": [
        "BIRMAN, K. P. Reliable distributed systems: technologies, web services, and applications, New York: Springer, 2005. ISBN 0387215093",
        "CLARK, M. et al. Web services business strategies and architectures. Expert Press, 2002. ISBN 1904284132",
        "JOSUTTIS, N. M. SOA in practice. O'Reilly, 2007. ISBN 0596529554",
        "LYNCH, N. A Distributed algorithms. M. Kaufmann, 1997",
        "ANENBAUM, A.S.; STEEN, M. van. Distributed Systems: Principles and Paradigms. Prentice Hall, 2nd Edition, 2006"
      ],
      "swebok": [
        "Software construction",
        "construção de software"
      ]
    },
    {
      "id": 26,
      "nome": "Construção de Software",
      "ementa": [
        "Visão geral (4h): construção (minimizar complexidade, antecipação de mudança, verificação, padrões), projeto de software (software design), qualidade de produto",
        "Planejamento (8h): linguagens de programação e processos de construção",
        "Gerência de construção (16h): controle de versão, inspeção e revisão de código",
        "Fundamentos de codificação (32h): estratégias recomendadas para criar código, variáveis, classes, interfaces, polimorfismo, rotinas, recursão, condições, laços, tratamento de exceção, reflexão, programação defensiva, padrão de codificação (leiaute e estilo), documentação, ferramentas de programação",
        "Projeto (design) detalhado e codificação (32h): noções de projeto detalhado, especificação de projeto, análise sintática (parsing), expressões regulares, parametrização (generics), closure, logging, configuração de software em tempo de execução",
        "Internacionalização",
        "Técnicas de construção baseadas em estado e tabelas",
        "Refatoração (8h)",
        "Testes de unidade (16h)",
        "Detecção e remoção de defeitos (debugging) (8h)",
        "Integração (4h): integração contínua."
      ],
      "cargaHorariaTotal": "128",
      "cargaHorariaTeorica": "48",
      "cargaHorariaPratica": "80",
      "periodo": 5,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "MCCONNELL, S. Code Complete: um guia prático para a construção de software 2.a edição. Porto Alegre, RS: Bookman, 2005. ISBN 8536305045",
        "GOODLIFFE, P. Como ser um programador melhor. Novatec, 2015. ISBN 978-85-7522-415-1",
        "ORAM, A.; WILSON, G. Beautiful code. O'Reilly, 2007. ISBN 9780596510046"
      ],
      "bibliografiaComplementar": [
        "FOWLER, M. Refatoração: aperfeiçoando o projeto de código existente Porto Alegre: Bookman, 2004, ISBN 8536303956",
        "IRVINE, K. R. C++ and object-oriented programming Upper Saddle River: Prentice-Hall, 1997. 526 p. Bibliografia e indice ISBN 0023598522 (broch.)",
        "BECK, K. Implementation patterns Upper Saddle River, NJ: Addison-Wesley, 2008. ISBN 0321413091",
        "MARTIN, R. C. Clean code: a handbook of agile software craftsmanship. Prentice Hall, 2009. ISBN 0132350882",
        "AGANS, D. J. Debugging the nine indispensable rules for finding even the most elusive software and hardware problems. AMACOM, 2002. ISBN 0814471684"
      ],
      "swebok": [
        "Software construction",
        "construção de software"
      ]
    },
    {
      "id": 27,
      "nome": "Modelagem de Software",
      "ementa": [
        "Conceitos (4h): software, qualidade de software, requisitos de software, projeto de software",
        "Processo de projeto de software (4h)",
        "Notações para registro de modelos orientados a objetos (16h)",
        "Modelagem de software orientado a objetos (40h)."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "16",
      "cargaHorariaPratica": "48",
      "periodo": 5,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "EVANS, E. Domain-driven design: tackling complexity in the heart of software Boston, MA: Addison-Wesley, 2004, ISBN 0321125215",
        "MCLAUGHLIN, B. D.; POLLICE, G.; WEST, D. Head First Object-Oriented Analysis & Design, O’Reilly, 2006",
        "AMBLER, S. W. Agile modeling: effective practices for eXtreme programming and the unified process. Wiley, 2002. ISBN 0471202827"
      ],
      "bibliografiaComplementar": [
        "MILLETT, S.; TUNE, N. Patterns, Principles and Practices of Domain-Driven Design. Wrox, 2015",
        "FOWLER, M. Analysis patternsreusable object models. Addison-Wesley, 1997. ISBN 0201895420",
        "MELLOR, S. J; SHLAER, S. Análise de sistemas orientada para objetos. São Paulo: McGraw-Hill, 1990",
        "KOWAL, J. A Behavior models: specifying user's expectations. Prentice Hall, 1992. ISBN 0132927152",
        "WAGNER, F. Modeling software with finite state machinesa practical approach. Auerbach, 2006. ISBN 9780849380860"
      ],
      "swebok": [
        "software construction",
        "construção de software",
        "software design",
        "projeto de software"
      ]
    },
    {
      "id": 28,
      "nome": "Processos de Software",
      "ementa": [
        "Visão geral (8h): processo, método e modelo",
        "Processos específicos de software: processos de implementação (12h), processos de suporte (12h) e processos de reutilização (2h)",
        "Qualidade de Processo: modelos de qualidade de processos (12h), avaliação da qualidade do processo (12h) e abordagens de implementação de processo (6h)"
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 5,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "FAIRLEY, R. E. Managing and Leading Software Projects, Wiley-IEEE Computer Society Press, 2009",
        "ISO/IEC/IEEE 12207:2008. Standard for Systems and Software Engineering-Software Life Cycle Processes. Portal: http://goo.gl/5ixAtq",
        "LARMAN, C. Agile and iterative development: a manager's guide. Addison-Wesley, 2004. ISBN 9780131111554"
      ],
      "bibliografiaComplementar": [
        "JOHNSON, K. A.; KULPA, M. K. Interpreting the CMMIa process improvement approach. Auerbach, 2003. ISBN 0849316545",
        "BEEDLE, M.; SCHWABER, K. Agile software development with Scrum. Prentice Hall, 2002. ISBN 0130676349",
        "PROWELL, S. J. Cleanroom software engineering technology and process Reading, Mass.: Addison-Wesley, 1999. ISBN 0201854805",
        "CAPUTO, K. CMM implementation guide choreographing software process improvement. Addison-Wesley, 1998. ISBN 0201379384",
        "MAGUIRE, S. Debugging the development processpractical strategies for staying focused, hitting ship dates, and building solid teams. Microsoft, 1994. ISBN 1556156502"
      ],
      "swebok": [
        "Software testing",
        "Teste de software",
        "Software Engineering Managment",
        "Gerencia de engenharia de software",
        "Software configuration management",
        "Gerencia de configuraço de software",
        "software engineering processo",
        "processo de software",
        "software engineering models and methods",
        "métodos e modelos de engenharia de software",
        "software quality",
        "qualidade de software",
        "software engineering professional practice",
        "prática profissional em engenharia de software",
        "software engineering economics",
        "economia em engenharia de software",
        "software requirements",
        "requisitos de software",
        "software design",
        "projeto de software",
        "software construction",
        "construção de software",
        "software maintenance",
        "manutenção de software"
      ]
    },
    {
      "id": 29,
      "nome": "Engenharia de Sistemas",
      "ementa": [
        "Fundamentos de engenharia (16h): métodos empíricos e técnicas experimentais; análise estatística; medição; design; modelagem, prototipação e simulação; normas e padrões; análise de causa raiz",
        "Fundamentos de sistema (16h): taxonomias de sistema; sistemas de engenharia (sistemas produzidos por engenharia - engineered systems); sistemas intensivos em software (software-intensive systems); sistemas de sistemas; complexidade de sistemas; propriedades emergentes; princípios do pensamento sistêmico; representação de sistemas por modelos",
        "Engenharia de Sistemas (32h): abordagens e metodologias; partes interessadas (stakeholders) e suas necessidades; ciclo de vida de sistemas de engenharia (concepção, conceitos operacionais, design, validação de design, construção, validação de construção, implantação, sustentação e descontinuação); processos do ciclo de vida de sistemas (negociação, preparação para projeto organizacional, gestão técnica, processos técnicos); qualidade de processo."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "64",
      "cargaHorariaPratica": "",
      "periodo": 5,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "PRESSMAN, R.; MAXIM, B. Software Engineering: A Practitioner’s Approach, 8th edition, McGraw-Hill, 2014",
        "SOMMERVILLE, I. Software Engineering, 10th Edition, Pearson, 2016",
        "WAZLAWICK, R. S. Engenharia de software: teoria e prática. Campus, 2013"
      ],
      "bibliografiaComplementar": [
        "ISO/IEC/IEEE 24765. Systems and software engineering - Vocabulary, 2010. Portal de periódicos da CAPES (http://goo.gl/FrGm7c)",
        "MAGELA, R. Engenharia de software aplicada. Alta Books, 2006.",
        "MPS.BR.  Melhoria de Processos do Software Brasileiro.",
        "Software Engineering Body of Knowledge (SWEBOK), V3, IEEE, Disponível em https://www.computer.org/web/swebok",
        "Software Engineering Competency Model (SWECOM), IEEE. Disponível em https://www.computer.org/web/peb/swecom."
      ],
      "swebok": [
        "Software engineering professional practice",
        "prática profissional em engenharia de software"
      ]
    },
    {
      "id": 30,
      "nome": "Design de Software",
      "ementa": [
        "Conceitos (8h): design, software, qualidade de software, requisitos de software, arquitetura de software e projeto detalhado",
        "Contexto de projeto de software (4h)",
        "Processos e artefatos de projeto de software (8h)",
        "Notações de projeto de software (8h)",
        "Princípios e fundamentos de projeto de software (16h): abstração, acoplamento, coesão, decomposição, encapsulamento, separar interface e implementação, suficiência, completitude, simplicidade e separation of concerns",
        "Aspectos de projeto de software (16h): concorrência, controle e tratamento de eventos, tratamento de exceção, persistência, distribuição, interação (apresentação)",
        "Qualidade de projeto de software (8h): técnicas de avaliação, medidas, ferramentas",
        "Métodos e estratégias de projeto (4h)",
        "Método para projeto orientado a objetos (4h)",
        "Padrões de projeto orientado a objetos (16h)",
        "Prática de projeto de software orientado a objetos (36h)."
      ],
      "cargaHorariaTotal": "128",
      "cargaHorariaTeorica": "48",
      "cargaHorariaPratica": "80",
      "periodo": 6,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "BUDGEN, D. Software Design, International Edition, 2nd Edition, Pearson Education, 2011",
        "HALL, G. M. Adptive Code via C#: Agile coding with design patterns and SOLID principles. Microsoft Press, 2014",
        "RUPING, A. Agile documentationa pattern guide to producing lightweight documents for software projects. Wiley, 2003. ISBN 0470856173"
      ],
      "bibliografiaComplementar": [
        "MILLETT, S.; TUNE, N. Patterns, Principles, and Practices of Domain-Driven Design, John Wiley & Sons, 2015",
        "ARGILA, C.; YOURDON, E. Análise e projeto orientados a objetos: estudos de casos São Paulo: Makron Books, 1999. ISBN 8534609756",
        "LARMAN, C. Applyng UML and patternsan introduction to object-oriented analysis and design. Prentice Hall PTR, 1997. ISBN 0137488807",
        "EVANS, E. Domain-driven designtackling complexity in the heart of software Boston, MA: Addison-Wesley, 2004. ISBN 0321125215",
        "HORSTMANN, C. S. Object-oriented design & patterns. 2nd edition. Hoboken, NJ: Wiley, 2006. ISBN 0471744875"
      ],
      "swebok": [
        "design de software",
        "projeto de software"
      ]
    },
    {
      "id": 31,
      "nome": "Domínios de Software",
      "ementa": [
        "Visão ampla de domínios de desenvolvimento (4h): sistemas, componentes e a relação entre eles",
        "Especificidades de alguns domínios de desenvolvimento (8h)",
        "Especificidades de um domínio (12h): requisitos, projeto, construção",
        "Desenvolvimento de software em um domínio (ênfase na construção) (40h)."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "16",
      "cargaHorariaPratica": "48",
      "periodo": 6,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "PILONE, D.; MILES, R.; Head-First Software Development, O’Reilly, 2008",
        "MCLAUGHLIN, B. D.; POLLICE, G.; WEST, D. Head First Object-Oriented Analysis & Design, O’Reilly, 2006",
        "BOOCH, G. Object-oriented analysis and design with applications. 2nd edition. Addison-Wesley, 1994. ISBN 0805353402"
      ],
      "bibliografiaComplementar": [
        "WAZLAWICK, R. S. Análise e design orientados a objetos para sistemas de informação: Modelagem com UML, OCL e IFML. 3.a edição. Campus, 2010",
        "PENKER, M.; ERIKSSON, H. E. Business modeling with UML: business patterns at work. John Wiley & Sons, 2000. ISBN 0471295515",
        "ODELL, J. J. Advanced object-oriented analysis and design using UML. Cambridge University Press, SIGS Books, 1998. ISBN 052164819X",
        "COCKBURN, A. Agile software development Boston: Addison-Wesley, 2002. (Agile software development series). ISBN 0201699699",
        "BEEDLE, M.; SCHWABER, K. Agile software development with Scrum. Prentice Hall, 2002. (Series in agile software development). ISBN 0130676349"
      ],
      "swebok": [
        "Software requirements",
        "requisitos de software"
      ]
    },
    {
      "id": 32,
      "nome": "Processos de Qualidade de Software",
      "ementa": [
        "Visão Geral de Qualidade de Software (4h): custos e impactos da qualidade de software, questões éticas e culturais da qualidade de software",
        "Processo de garantia da qualidade de software (10h): garantia do produto e garantia do processo",
        "Processo de Verificação e Validação de Software (36h): requisito, projeto (design), código, integração, documentação",
        "Processos de Revisão e Auditoria de Software (14h): revisões gerenciais e revisões técnicas."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "48",
      "cargaHorariaPratica": "16",
      "periodo": 6,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "Stefan Wagner. Software Product Quality Control. Springer-Verlag Berlin Heidelberg. 2013",
        "Software Quality Assurance: From Theory to Implementation, Daniel Galin, Addison-Wesley, 2004",
        "MURPHY, Mark L C/C++ software quality tools Upper Saddle River: Prentice Hall PTR, 1996. ISBN 0134451236"
      ],
      "bibliografiaComplementar": [
        "OSCIANSK, A.; SOARES, M. S. Qualidade de Software. Editora Novatec, 2007",
        "CERTIFICAÇÃO CERTICS: um instrumento de política pública para inovação tecnológica em software. CTI Renato Archer, 2015. ISBN 9788565163088",
        "KELLIHER, T. P.; KEEGAN, J. G.; OLIVER, D. W. Engineering complex systems with models and objects. McGraw-Hill, 1997. ISBN 0070481881",
        "KAN, S. H. Metrics and models in software quality engineering. 2nd edition. Addison-Wesley, 2003. ISBN 0201729156",
        "BARTIÉ, A. Garantia da qualidade de software. Campus, 2002. ISBN 8535211245"
      ],
      "swebok": [
        "software quality",
        "qualidade de software"
      ]
    },
    {
      "id": 33,
      "nome": "Gerência de Projeto de Software",
      "ementa": [
        "Projeto e gerência de projeto (4h): ciclo de vida de produto, serviço e projeto; partes interessadas (stakeholders); correlação entre projetos, operações e programas; gerência de portfólio de projetos; escritório de projetos (PMO)",
        "Tipos de projeto de software (4h): aquisição, desenvolvimento, refatoração, descontinuação",
        "Tipos de ciclo de vida de projeto de software (4h): preditivo, iterativo, adaptativo; processos empíricos e processos definidos e sua relação com métodos ágeis e métodos planejados para gerência de projeto de software",
        "Modelos de qualidade de processo de gerência de projeto de software (4h)",
        "Áreas de conhecimento da gerência de projetos aplicadas a projetos de software (48h): escopo, tempo, custo, qualidade, recursos humanos, comunicações, riscos, aquisições, integração e partes interessadas"
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 6,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "PMI. Um Guia do Conhecimento em Gerenciamento de Projetos. 5.a edição. São Paulo: Saraiva, 2012. ISBN 9788502223721",
        "CHEMUTURI, M. K.; CAGLEY, T. M. Jr. Mastering Software Project Management: Best Practices, Tools and Techniques. J. Ross Publishing, 2010. ISBN-13: 978-1604270341",
        "COHN, M. Agile estimating and planning Upper Saddle River, NJ: Prentice Hall Professional Technical Reference, 2006. ISBN 0131479415"
      ],
      "bibliografiaComplementar": [
        "FAIRLEY, R.E. Managing and Leading Software Projects. John Wiley & Sons, 2009",
        "HIGHSMITH, J. A. Agile project management: creating innovative products 2nd. edition. Addison-Wesley, 2010. ISBN 0321658396",
        "SCHWABER, K. Agile project management with Scrum. Microsoft Press, 2004. ISBN 073561993X",
        "DEMARCO, T. Controle de projetos de software: gerenciamento, avaliação, estimativa. Campus, 1991. ISBN 8570015283",
        "MARTINS, J. C. C. Gerenciando projetos de desenvolvimento de software com PMI, RUP e UML. 4.a edição. Brasport, 2007"
      ],
      "swebok": [
        "software configuration management",
        "gerencia de configuraço de software"
      ]
    },
    {
      "id": 34,
      "nome": "Software Concorrente e Distribuído",
      "ementa": [
        "Qualidade de produto (4h): escalabilidade, tolerância a falhas, disponibilidade, desempenho.",
        "Conceitos (4h): middleware, distribuição, paralelismo, concorrência, RESTful, web, internet das coisas, contêineres, troca de mensagens, micro-serviços, serviços web.",
        "Métodos para construção de software distribuído e para construção de software concorrente (8h).",
        "Concorrência (16h): paralelismo, aplicações IO-intensive e CPU-intensive, thread safe, memória compartilhada, Software Transactional Memory, atores, abordagens para explorar concorrência.",
        "Distribuição (24h): projeto, implementação e uso de interface de programação, RESTful, serviços web e micro-serviços (microservices).",
        "Troca de mensagens (messaging) (8h)."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 7,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "BUTCHER, P. Seven Concurrent Models in Seven Weeks. Pragmatic Bookshelf, 2014. ISBN-10: 1937785653",
        "DAIGNEAU, R. Service Design Pattern. Addison-Wesley, 2011. ISBN 032154420X",
        "FOSTER, I. Designing and building parallel programsconcepts and tools for parallel software engineering Reading, Mass.: Addison-Wesley, 1995. ISBN 0201575949"
      ],
      "bibliografiaComplementar": [
        "NEWMAN, S. Building Microservices. O’Reilly, 2015",
        "BARNES, L. L. Client/server & beyound strategies for 21st century. Prentice-Hall, 1997. ISBN 0135325161",
        "SHATZ, S. M. Development of distributed software concepts and tools. Macmillan, 1993. ISBN 0024096113",
        "PAGE-JONES, M. Fundamentals of object-oriented design in UML.  Addison-Wesley, 2003. ISBN 020169946X",
        "RODRIGUES, L.; GUERRAOUI, R. Introduction to reliable distributed programming. Springer, 2006. ISBN 9783540288459"
      ],
      "swebok": [
        "software construction",
        "construção de software"
      ]
    },
    {
      "id": 35,
      "nome": "Experiência do Usuário de Software",
      "ementa": [
        "Qualidade em uso (4h): usabilidade, acessibilidade.",
        "Design centrado no usuário (8h): diretrizes, pesquisa, personas, jornadas de usuário, modelagem (especificação) e ferramentas.",
        "Projeto de interação (16h): diretrizes, criação, modelagem (especificação) e ferramentas.",
        "Design de software e interfaces gráficas (8): padrões arquiteturais para design da camada de apresentação (MVC, MVP, MVVM e outros).",
        "Implementação de interfaces (20h).",
        "Modelos de validação de experiência (8h): modelos, métodos e técnicas para validação de experiência do usuário."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 7,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "GOTHELF, J.; SEIDEN, J. Lean UX: Applying Lean Principles to Improve User Experience, O’Reilly, 2013",
        "KRUG, S., Don´t make me think: revisited. New Riders, 2014. ISBN 978-0321965516",
        "BORBA, F. E. Ajax: guia de programação. São Paulo: Erica, 2006. ISBN 8536501375"
      ],
      "bibliografiaComplementar": [
        "PREECE, J.; SHARP, H.; ROGERS, Y. Interaction Design: Beyond Human-Computer Interaction, Wiley, 2015. ISBN 978-1119020752",
        "CYBIS, W. O. Ergonomia e usabilidade: conhecimentos, métodos e aplicações. 2a. edição. São Paulo: Novatec, 2010. ISBN 9788575222324",
        "COUTAZ, J.; BASS, L. Developing software for the user interface. Addison-Wesley, 1991. ISBN 0201510464",
        "HARTSON, H. R.; HIX, D. Developing user interfaces: ensuring usability through product & process. Wiley, 1993. ISBN 0471578134",
        "OLSEN, D. R. Developing user interfaces. Morgan Kaufmann, 1998. ISBN 1558604189"
      ],
      "swebok": [
        "software quality",
        "qualidade de software",
        "software construction",
        "construção de software",
        "software requirements",
        "requisitos de software"
      ]
    },
    {
      "id": 36,
      "nome": "Arquitetura de Software",
      "ementa": [
        "Conceitos (4h): software, qualidade de software, requisitos de software, arquitetura de software e projeto detalhado.",
        "Requisitos funcionais e requisitos de qualidade (8h): conceituação e identificação de requisitos relevantes para a arquitetura.",
        "Documentação de arquitetura de software (8h).",
        "Fundamentos de arquitetura de software (4h): importância, contexto, estilos.Método de desenvolvimento de arquitetura de software (8h).",
        "Técnicas para satisfazer requisitos de qualidade (16h).Criação de arquiteturas de software (16h)."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 7,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "FOWLER, M., Patterns of Enterprise Application Architecture, ISBN-13: 978-0321127426, Addison-Wesley, 2002",
        "DAIGNEAU, R., Service Design Patterns, ISBN-13: 978-0321544209, Addison-Wesley, 2011",
        "BUSCHMAN, F. Pattern-oriented software architecture. Wiley, 2001. ISBN 0471606952"
      ],
      "bibliografiaComplementar": [
        "VERNON, V. Implementing Domain-Driven Design. Addison-Wesley, 2013. ISBN 978-0-321-83457-7",
        "GAMMA, E. Design patterns elements of reusable object-oriented software. Addison Wesley, 1995. ISBN 0201633612",
        "TROTT, J.; SHALLOWAY, A. Design patterns explained: a new perspective on object-oriented design. 2nd ed. Addison-Wesley, 2005. ISBN 0321247140",
        "PREE, W. Design patterns for object-oriented software development. Addison-Wesley, 1995. ISBN 0201422948",
        "FREEMAN, E. et al. Head First design patterns. O'Reilly, 2004. ISBN 0596007124"
      ],
      "swebok": [
        "software design",
        "projeto de software"
      ]
    },
    {
      "id": 37,
      "nome": "Requisitos de Software",
      "ementa": [
        "Processo de requisitos (16h): definições básicas, eliciação de requisitos, análise de requisitos, especificação de requisitos, verificação e validação de requisitos.",
        "Modelos e métodos da engenharia de requisitos (32).Gerência de projetos de engenharia de requisitos (8).",
        "Processo de projeto arquitetural (8h): relação com requisitos.",
        "Processo de requisitos (16h): definições básicas, eliciação de requisitos, análise de requisitos, especificação de requisitos, verificação e validação de requisitos.",
        "Modelos e métodos da engenharia de requisitos (32).",
        "Gerência de projetos de engenharia de requisitos (8).",
        "Processo de projeto arquitetural (8h): relação com requisitos.",
        "Processo de requisitos (16h): definições básicas, eliciação de requisitos, análise de requisitos, especificação de requisitos, verificação e validação de requisitos.",
        "Modelos e métodos da engenharia de requisitos (32).",
        "Gerência de projetos de engenharia de requisitos (8).",
        "Processo de projeto arquitetural (8h): relação com requisitos."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 7,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "WIEGERS, K. E. Software Requirements. Microsoft Press, 3rd edition, 2013",
        "ROBERTSON, S. Mastering the Requirements Process: Getting Requirements Right. Addison-Wesley Professional, 3rd edition, 2012",
        "WINTERS, J. P.; SCHNEIDER, G. Applying use cases: a practical guide, 2nd edition. Addison-Wesley, 2001. (The Addison-Wesley object technology series). ISBN 0201708531."
      ],
      "bibliografiaComplementar": [
        "COCKBURN, A. Writing Effective Use Cases. Addison-Wesley, 2000",
        "MELLOR, S. J; SHLAER, S. Análise de sistemas orientada para objetos. São Paulo: McGraw-Hill, 1990",
        "MILLER, G.; ARMOUR, F. Advanced use case modeling: software systems. Boston: Addison-Wesley, 2001. (Addison-Wesley object technology series) ISBN 0201615924",
        "YOURDON, E.; COAD, P. Análise baseada em objetos. 2a. edição. Rio de Janeiro: Campus, 1996. ISBN 8535200428",
        "WIEGERS, K. E. More about software requirements: thorny issues and practical advice. Microsoft Press, 2006. ISBN 9780735622678"
      ],
      "swebok": [
        "software requirements",
        "requisitos de software"
      ]
    },
    {
      "id": 38,
      "nome": "Governança e Gestão de Serviços de Software",
      "ementa": [
        "Governança (8h): governança corporativa; governança de TI (GTI); governança de Software (GS); princípios da GS; conformidade (compliance); alinhamento dos serviços de software ao negócio da organização; normas, frameworks, padrões, modelos de qualidade e de maturidade de GS",
        "Abordagens para GS (8h): aplicação de abordagens de GS em um contexto organizacional",
        "Objetivos de controle para GS; indicadores e avaliação de desempenho de software; direcionamento, avaliação e controle do uso de serviços de software para apoiar os objetivos de uma organização",
        "Planejamento e controle estratégico de software (8h): alinhamento entre objetivos organizacionais e objetivos relacionados a software; avaliação, direcionamento e monitoramento de processos de software; diagnóstico de maturidade de processos de software; alinhamento de políticas de software ao plano diretor de TI de uma organização",
        "Gestão de riscos de software; riscos organizacionais; riscos relacionados à segurança física e lógica de software",
        "Governança de dados (8h): Segurança da informação em uma organização; Segurança de software",
        "Software como um serviço (SaaS) (8h): serviços de Software (SS); gestão de Serviços de Software (GSS);Estratégia organizacional para SS; Modelos, normas e padrões relacionados à GSS",
        "Ciclo de vida de SS (8h): planejamento; desenvolvimento; implantação e sustentação; Operação de SS e apoio (suporte) à operação de SS; Descontinuação de SS",
        "Manutenção de SS (8h): correção, adaptação e evolução de SS; gestão de incidentes e problemas em SS; controle de mudança e de configuração; controle de qualidade",
        "Gerência de processos de negócio (BPM – Business Process Management) aplicada à GSS (8h): representação de SS como processos de negócio; notação para modelagem de processos de negócio (BPMN); análise, validação e evolução de processos de negócio e de SS."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "48",
      "cargaHorariaPratica": "16",
      "periodo": 7,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "GREMBERGEN, W. V.; HAES, S. Enterprise Governance of Information Technology: Achieving Strategic Alignment and Value. Springer, 2010. ISBN-13 978-1441946621",
        "BROOKS, P. Metrics for Service Management: Designing for ITIL. 1st edition. Van Haren Publishing, 2012",
        "SHIAVON, M. Acordos de nível operacional para controle do processo de manutenção de software, Mestrado em Engenharia Elétrica, Universidade Federal de Goiás, 2009"
      ],
      "bibliografiaComplementar": [
        "GUTH, S. Contract Negotiation Handbook: Software as a Service. Guth Ventures LLC, 2013",
        "ERDOGMUS, H.; TANIR, O. Advances in software engineering comprehension, evaluation, and evolution. Springer, 2002. ISBN 0387951091",
        "HASS, A. M. J. Configuration management principles and practice. Addison-Wesley, 2003. (The Agile software development series). ISBN 0321117662",
        "MARSHALL, C. Enterprise modeling with UML: designing successful software through business analysis. Addison-Wesley, 2000. ISBN 0201433133",
        "CENTRO DE GESTÃO E ESTUDOS ESTRATÉGICOS. Ciência, tecnologia e sociedade: novos modelos de governança. Brasilia, CGEE, 2005"
      ],
      "swebok": [
        "software maintenance",
        "manutenção de software",
        "software configuration management",
        "gerencia de configuraço de software"
      ]
    },
    {
      "id": 39,
      "nome": "Software para Sistemas Ubíquos",
      "ementa": [
        "Sistemas de informação que fazem uso de dispositivos (ubíquos) (16h): smartphones, sensores, internet das coisas (IoT), stream analytics e aspectos de segurança (vulnerabilidades, criptografia, certificados digitais).",
        "Definição de arquiteturas para soluções móveis (16): conectar serviços, possivelmente de grande volume, fluxo e em tempo real, com a necessidade de analisá-los.",
        "Desenvolvimento de código para smartphone, sensor ou outro dispositivo capaz de alimentar/receber informações de sistema de informação (32h)."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 8,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "MCGRAW, G. Software Security: Build Security In. Addison-Wesley, 2006",
        "GREENGARD, S. The Internet of Things. The MIT Press, 2015",
        "WILMSHURST, T. An introduction to the design of small-scale embedded systems. Palgrave, 2001. ISBN 0333929942"
      ],
      "bibliografiaComplementar": [
        "MANICO, J.; DETLEFESEN, A. Iron-Clad Java: Building Secure Web Applications. McGraw-Hill, 2014",
        "HOWARD, M. 19 deadly sins of software securityprogramming flaws and how to fix them. McGraw-Hill/Osborne, 2005. ISBN 0072260858",
        "MARK, D. Dominando o desenvolvimento no iPhone: explorando o SDK do iPhone. Alta Books, 2009. ISBN 97885760833757",
        "VAHID, F. Embedded system design: a unified hardware/software introduction. John Wiley & Sons, 2002. ISBN 0471386782",
        "KERN, C.; KESAVAN, A.; DASWANI, N. Foundations of security: what every programmer needs to know. Apress, 2007. ISBN 9781590597842"
      ],
      "swebok": [
        "Software engineering professional practice",
        "prática profissional em engenharia de software"
      ]
    },
    {
      "id": 40,
      "nome": "Software para Persistência de Dados",
      "ementa": [
        "Visão geral de persistência (12h): arquivos em formato texto/binário",
        "Serialização de objetos",
        "Documentos XML",
        "JSON",
        "Bancos de dados relacionais",
        "Bancos NoSql.",
        "Modelagem e implementação de bancos de dados (28h).",
        "Mapeamento entre OO e relacional (8h).",
        "Refatoração de bancos de dados (8h).",
        "Integração de bancos de dados (8h)."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 8,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "REDMOND, E.; WILSON, J. Seven databases in Seven Weeks. Pragmatic Bookshelf, 2012",
        "MCMURTRY, D. et al. Data Access for Highly-Scalable Solutions: Using SQL, NoSQL, and Polyglot Persistence. Microsoft Press, 2013",
        "AMBLER, S. W. Agile database techniques: effective strategies for the agile software developer. Wiley, 2003. ISBN 0471202835"
      ],
      "bibliografiaComplementar": [
        "AMBLER, S. J.; SADALAGE, P. J. Refactoring Databases. Addison-Wesley, 2006",
        "GOLENDZINER, L. G.; PRICE, R. T. Bancos de dados para aplicações não convencionais. EBAI, 1989. ISBN 950139879",
        "FALINO, J.; HERION, D.; MARTINER, W. Building distributed applications with ADO. John Wiley & Sons, 1999. ISBN 0471317012",
        "KING, G.; BAUER, C. Java Persistence com Hibernate. Ciencia Moderna, 2007. ISBN 9788573936148",
        "MANNINO, M. V. Projeto, desenvolvimento de aplicações e administração de banco de dados. McGraw-Hill, 2008. ISBN 9788577260201"
      ],
      "swebok": [
        "software construction",
        "construção de software",
        "software design",
        "projeto de software"
      ]
    },
    {
      "id": 41,
      "nome": "Padrões de Arquitetura de Software",
      "ementa": [
        "Conceitos (12h): arquitetura de software e padrões de arquitetura (blackboard, microservices, invocação implícita, arquitetura orientada a serviços, multitier, arquitetura orienta a eventos, plugin, filtros e pipes, MVC).",
        "Norma ISO/IEC/IEEE 42010:2011 (8h).",
        "Análise (avaliação) de arquiteturas de software (12h).",
        "Criação de arquiteturas de software (32h)."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 8,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "BUDGEN, B. Software Design, 2nd edition, Addison­Wesley, 2003",
        "BASS, L. et al. Software Architecture in Practice, 3rd edition, Addison­Wesley, 2012",
        "LARMAN, C. Utilizando UML e padrões: uma introdução à análise e ao projeto orientados a objetos e ao desenvolvimento interativo. Bookman, 2008"
      ],
      "bibliografiaComplementar": [
        "BOOCH, G. UML guia do usuário: o mais avançado tutorial sobre Unified Modeling Language (UML). Elsevier, 2006",
        "FREEMAN, E. et al. Use a cabeça!: padrões de projetos, (design patterns), Alta Books, 2007",
        "FOWLER, M. Patterns of enterprise application architecture. Addison­Wesley, 2003",
        "GAMMA, E. et al. Design patterns elements of reusable object-oriented software. Reading: Addison Wesley, 1995",
        "NYGARD, M. Release It!: Design and Deploy Production­Ready Software, Pragmatic Bookshelf, 2007"
      ],
      "swebok": [
        "software construction",
        "construção de software",
        "software design",
        "projeto de software"
      ]
    },
    {
      "id": 42,
      "nome": "Teste de Software",
      "ementa": [
        "Processo de construção (8h): definições básicas, atividades e documentação.",
        "Processo de Teste de Software (56): definições básicas, técnicas de teste, teste baseado em intuição e experiência do engenheiro de software, atividades do processo, documentação e ferramentas."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "32",
      "cargaHorariaPratica": "32",
      "periodo": 8,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "MYERS, G. J. The Art of Software Testing. Wiley. 2011",
        "COPELAND, L. A Practitioner’s Guide to Software Test Design. Artech House, 2003",
        "SYKES, D. A.; MCGREGOR, J. D. A practical guide to testing object-oriented software. Addison-Wesley, 2001. ISBN 0201325640"
      ],
      "bibliografiaComplementar": [
        "MESZAROS, G. xUnit test patternsrefactoring test code. Addison-Wesley, 2007. ISBN 0131495054",
        "MOSLEY, D. J. Client-server software testing on the desktop and the Web. Prentice Hall, 2000. ISBN 0131838806",
        "GROSS, H. Component-based software testing with UML. Springer, 2005. ISBN 354020864X",
        "PERRY, W. E. Effective methods for software testing. 2nd edition. J. Wiley, 1999. ISBN 047135418X",
        "WU, M.; LI, K. Effective software test automationdeveloping an automated software testing tool. SYBEX, 2004. ISBN 0782143202"
      ],
      "swebok": [
        "software quality",
        "qualidade de software",
        "software testing",
        "teste de software"
      ]
    },
    {
      "id": 43,
      "nome": "Metodologia e Experimentação em Engenharia de Software",
      "ementa": [
        "Metodologia Científica (16h): aplicação de metodologia científica em atividades de Engenharia de Software",
        "Fundamentos da Engenharia de Software Experimental (16h): contexto da experimentação na Engenharia de Software; principais tipos de experimentos aplicados à Engenharia de Software; estudos primários e secundários; revisão e mapeamento sistemático da literatura",
        "Realização de Experimentos em Engenharia de Software (32h)."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "48",
      "cargaHorariaPratica": "80",
      "periodo": 10,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "JURISTO, N. Basics of software engineering experimentation. Kluwer Academic Publishers, 2001. ISBN 079237990X",
        "WOHLIN, C. et al. Experimentation in Software Engineering. 2nd edition. Springer, 2012",
        "GETTINBY, G; GARDINER, W. P. Experimental design techniques in statistical practice: a practical software-based approach. Horwood Pub., 1998. ISBN 1898563357"
      ],
      "bibliografiaComplementar": [
        "WAZLAWICK, R. S. Metodologia de Pesquisa para Ciência da Computação. Editora Campus, 2009",
        "WOHLIN, C. Experimentation in software engineering: an introduction. Kluwer Academic, 2000. ISBN 0792386825",
        "POLYAK, B. T. Introduction to optimization. Optimization Software, 1987. ISBN 0911575146",
        "HALL, E. M. Managing risk methods for software systems development. Addison-Wesley, 1998. ISBN 0201255928",
        "QUALIDADE no setor de software brasileiro. Brasilia, D.F.: MCT, 1997"
      ],
      "swebok": [
        "software engineering process",
        "processo de engenharia de software"
      ]
    },
    {
      "id": 44,
      "nome": "Mercado e Economia de Software",
      "ementa": [
        "Modelos de negócio para software (aluguel, serviço, código aberto).",
        "Leis, normas, impostos e legislação brasileira para o mercado local e para a exportação de software.",
        "Programas de incentivo à exportação e à produção de software.",
        "Características e exigências do mercado interno e externo.",
        "Identificação de oportunidades de inovação em software.",
        "Planos de negócio de software para o mercado nacional e global.",
        "Engenharia Econômica.",
        "Fornecimento, demanda e produção.",
        "Lucro produzido por capital (interest).",
        "Análise custo-benefício.",
        "Análise breakeven.",
        "Retorno de investimento.",
        "Avaliação de alternativas.",
        "Economia aplicada ao desenvolvimento de software."
      ],
      "cargaHorariaTotal": "64",
      "cargaHorariaTeorica": "48",
      "cargaHorariaPratica": "80",
      "periodo": 10,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "TOCKEY, S. Return on Software: Maximizing the Return on Your Software Investment, Addison-Wesley, 2004",
        "GRADY, S. O. The software paradox: the rise and fall of the commercial software market. O’Reilly, 2015",
        "SALIM, C. S. Construindo planos de negócios: todos os passos necessários para planejar e desenvolver negócios de sucesso. 3.a edição. Rio de Janeiro: Elsevier, 2005. ISBN 8535217363"
      ],
      "bibliografiaComplementar": [
        "BROOKS J., F. P. O mítico homem-mês: ensaios sobre engenharia de software. Elsevier, 2009. ISBN 9788535234879",
        "ENGHOLM J. H. Engenharia de software na prática. São Paulo: Novatec, 2010. ISBN 9788575222171",
        "PIMENTEL, L. O. A proteção jurídica da propriedade intelectual de software: noções básicas e temas relacionados. IEL, 2008. ISBN 9788587683045",
        "ORRICO J, H. Pirataria de Software. MM Livros, 2004. ISBN 8590424219",
        ""
      ],
      "swebok": [
        "software requirements",
        "requisitos de software",
        "software testing",
        "teste de software",
        "software engineering economics",
        "economia em engenharia de software"
      ]
    },
    {
      "id": 45,
      "nome": "Prática em Engenharia de Software",
      "ementa": [
        "Aplicação do corpo de conhecimento da Engenharia de Software no contexto de projetos realizados em uma Fábrica de Software (320h): emprego de processos de Engenharia de Software em abrangência e profundidade;",
        "Seleção e utilização de normas, métodos, técnicas e ferramentas de Engenharia de Software para atingir objetivos estabelecidos no projeto;",
        "Integração e consolidação de conhecimentos e habilidades esperadas do profissional de Engenharia de Software;",
        "Exercício de práticas e atitudes profissionais embasadas no código de ética e na postura profissional da Engenharia de Software;",
        "Prática em processos técnicos de Engenharia de Software;",
        "Prática em Gestão de Engenharia de Software;",
        "Prática em Tecnologias de Engenharia de Software."
      ],
      "cargaHorariaTotal": "320",
      "cargaHorariaTeorica": "",
      "cargaHorariaPratica": "320",
      "periodo": 9,
      "obrigatoria": "Sim",
      "preRequisitos": "",
      "nucleo": "NC",
      "bibliografiaBasica": [
        "SOMMERVILLE, I. Engenharia de Software. Pearson, 10.a edição, 2015",
        "MCCONNELL, S. Code complete: a practical handbook of software construction. 2nd edition. Microsoft Press, 2009",
        "PAULA, W. P. Engenharia de software: fundamentos, métodos e padrões 3.a edição. LTC, 2009. ISBN 9788521616504"
      ],
      "bibliografiaComplementar": [
        "PRESSMAN, R. Engenharia de Software. 8.a edição. McGraw-Hill, 2014",
        "SCHACH, S. R. Engenharia de software: os paradigmas clássicos & orientados a objetos. 7.a edição. McGraw-Hill, 2009. ISBN 9788577260454",
        "PFLEEGER, S. L. Engenharia de software: teoria e prática. 2.a edição. Prentice Hall, 2004. ISBN 8587918311",
        "PEDRYCZ, W.; PETERS, J. F. Engenharia de software: teoria e prática. Campus, 2003. ISBN 8535207465",
        "MAGELA, R. Engenharia de software aplicada: princípios. Alta Books, 2006. ISBN 8576081202"
      ],
      "swebok": [
        "Software testing",
        "Teste de software",
        "Software Engineering Managment",
        "Gerencia de engenharia de software",
        "Software configuration management",
        "Gerencia de configuraço de software",
        "software engineering processo",
        "processo de software",
        "software engineering models and methods",
        "métodos e modelos de engenharia de software",
        "software quality",
        "qualidade de software",
        "software engineering professional practice",
        "prática profissional em engenharia de software",
        "software engineering economics",
        "economia em engenharia de software",
        "software requirements",
        "requisitos de software",
        "software design",
        "projeto de software",
        "software construction",
        "construção de software",
        "software maintenance",
        "manutenção de software"
      ]
    }
  ],
  "informacoes": [{
    "topico": "Apresentação",
    "descricao": [
      "O curso de Bacharelado em Engenharia de Software (BES) é oferecido pelo Instituto de Informática (INF) da Universidade Federal de Goiás (UFG). A primeira versão do Projeto Pedagógico do Curso (PPC) foi criada em 2008, a segunda versão, registrada nesse documento, é fruto de uma reflexão de dois anos do Núcleo Docente Estruturante (NDE), que reinventou o BES.",
      "A busca pela qualidade é a motivação (p. ) dessa segunda versão, que só pode ser adequadamente compreendida com o detalhamento da história da criação do curso e do cenário no qual está inserido (p. ), o que lembra Paulo Freire, segundo o qual “toda leitura de texto pressupõe uma rigorosa leitura do contexto”.",
      "Não houve alteração relevante dos objetivos do curso (p. ), nem tampouco do perfil do egresso (p. ), contudo, ambos foram refinados. Os requisitos legais e normativos foram ampliados pelas diretrizes curriculares nacionais (que não existiam quando a primeira versão foi produzida). Em particular, a estratégia para atender a educação das relações étnico-raciais e para o ensino de história e cultura afro-brasileira e africana foi revista em sua totalidade.",
      "A estrutura curricular (p. ) sofreu mudanças significativas. Em particular, o fluxo sugerido, nos quatro primeiros períodos, inclui apenas disciplinas de formação básica em computação. A disciplina “Prática em Engenharia de Software” (p. ) é o elemento integrador do curso, com carga horária de 320 horas. Em particular, as disciplinas específicas de Engenharia de Software são acompanhadas de uma seção adicional, “condições mínimas” (p. ), que estabelece competências a serem demonstradas/adquiridas pelo estudante em cada uma delas.",
      "A busca por um curso de Engenharia de Software melhor é uma atribuição contínua do NDE estabelecida nesse PPC por meio de princípios (p. ). Esse compromisso é oportuno para estabelecer claramente a responsabilidade pela gestão do presente PPC pelo NDE, sem o qual esse texto resume-se a um registro de intenções."
    ],
    "conteudo": [{
      "subtopico": "",
      "detalhe": [""]
    }]
  },
    {
      "topico": "Objetvos",
      "descricao": [""],
      "conteudo": [{
        "subtopico": "Objetivo geral",
        "detalhe": [
          "O BES tem como objetivo: ",
          "Formar profissionais aptos a contribuir efetivamente com a produção de softwares de qualidade seguindo princípios éticos e postura profissional."
        ]
      },
        {
          "subtopico": "Objetivos específicos",
          "detalhe": [
            "Reconhecer e valorizar o respeito à diversidade. Conforme se lê na Constituição Federal em seu Art. 3.º, inciso IV: “promover o bem de todos, sem preconceitos de origem, raça, sexo, cor, idade e quaisquer outras formas de discriminação”.",
            "Promover relações étnico-raciais respeitosas, assim como a socialização da história da formação dos brasileiros.",
            "Ampliar a compreensão acerca de questões ambientais e, ao mesmo tempo, valorizar projetos sustentáveis.",
            "Ampliar a compreensão acerca de questões ambientais e, ao mesmo tempo, valorizar projetos sustentáveis.",
            "Contribuir com a demanda da sociedade por softwares de qualidade.",
            "Conceber e desenvolver produtos inovadores.",
            "Promover a engenharia de software na indústria de software regional.",
            "Viabilizar atividade econômica de alto valor (produção de software).",
            "Criar alternativa econômica para o Estado de Goiás.",
            "Fortalecer a indústria de software goiana."
          ]
        }
      ]
    },
    {
      "topico": "Expectativa da formação do profissional",
      "descricao": [""],
      "conteudo": [{
        "subtopico": "Perfil do egresso",
        "detalhe": [
          "O egresso do BES é um profissional com capacitação sólida em engenharia de software. Essa capacitação advém de formação básica consistente em computação e de abrangente e aprofundada em engenharia de software.",
          "O mercado de atuação do egresso é abrangente, e decorre da dependência da sociedade por software. Adicionalmente, tal dependência tem se expandido com novos produtos, serviços e processos.",
          "A bacharela ou o bacharel em Engenharia de Software é capaz de efetivamente contribuir com equipes na produção de modelos abstratos de software e realizá-los por meio de código de qualidade. Essa contribuição é pautada por postura profissional e conduta ética.",
          "As habilidades do egresso incluem o que é necessário para lidar com requisitos de software, propor uma solução (software design), construí-la, testá-la e mantê-la, usando processos adequados."
        ]
      },
        {
          "subtopico": "Habilidades do egresso",
          "detalhe": [
            "COLOCAR CONTEÚDO"
          ]
        }
      ]
    },
    {
      "topico": "Princípios norteadores",
      "descricao": [
        "O BES baseia-se em princípios que fornecem a sustentação necessária para atingir os objetivos do curso (p. ) e o perfil do egresso (p. ). Esses princípios são fornecidos abaixo."
      ],
      "conteudo": [{
        "subtopico": "Formação Ética e Função Social do Profissional",
        "detalhe": [
          "A vivência de princípios éticos e o conhecimento sobre a responsabilidade social do Engenheiro de Software são elementos imprescindíveis para a formação da postura profissional do egresso do BES.",
          "Ética é assunto de uma das disciplinas do primeiro semestre do curso, “Computação e Sociedade” (p. ), e volta a ser explicitamente tratada, junto com aspectos profissionais, na última disciplina do curso “Prática em Engenharia de Software” (p. ). Nesse caso, a postura ética e profissional é condição a ser observada para aprovação nessa disciplina.",
          "O comportamento ético e profissional será trabalhado nas atividades do curso, e não apenas na primeira e última disciplinas. A exigência de uma conduta apropriada em sala de aula, tanto dos docentes quanto dos estudantes, contribui com essa formação. Isso significa promover a qualidade de vida, o respeito à diversidade, o respeito ao meio ambiente. Nesse sentido, não apenas as disciplinas, mas toda e qualquer ação, deve ser pautada pela reflexão do impacto no contexto no qual se insere.",
          "Ainda convém destacar que a área possui um código de ética próprio, Código de Ética e Prática Profissional da Engenharia de Software [ACM/IEEE]. Esse código é uma das bases de fundamentação do curso e deve ser observado no convívio diário do curso."
        ]
      },
        {
          "subtopico": "Formação Técnica",
          "detalhe": [
            "A formação técnica proposta para o BES está fundamentada em bases sólidas: as diretrizes curriculares nacionais [MEC 2012], o guia do corpo de conhecimento em Engenharia de Software [SWEBOK 2014], o corpo de conhecimento recomendado para ser trabalhado em um curso de graduação [SE 2014], e o modelo de competência em Engenharia de Software [SWECOM 2014]. Em consequência, o conteúdo abordado no curso não diverge das orientações nacionais nem internacionais. A organização dele, contudo, é uma “contribuição” para a área, dado que se baseia em experiências aprendidas nos anos anteriores, juntamente com uma visão holística do aprendizado em Engenharia de Software, o que contrasta com a frequente apresentação cartesiana dessa área.",
            "As atividades do curso se aproximam do emprego da Engenharia de Software em projetos reais, no qual os conhecimentos e habilidades não são exigidos de forma fragmentada e isolada. O isolamento de conteúdo é adequado para a classificação do conhecimento que, sem o devido cuidado, pode induzir a definição de disciplinas. A estratégia de definição das disciplinas do BES é fornecida abaixo."
          ]
        },
        {
          "subtopico": "Estratégia da definição das disciplinas",
          "detalhe": [
            "As disciplinas do BES foram definidas com substancial cruzamento de fronteiras de subáreas do conhecimento da Engenharia de Software. A estratégia na qual se define uma disciplina por subárea foi preterida. Convém ressaltar que o corpo de conhecimento da área [SWEBOK 2014] foi extensivamente empregado, mas não como exemplo de organização didática.",
            "Em vez da separação de tópicos induzida pela classificação do conhecimento, o conteúdo (ementa) atribuído a cada disciplina do BES inclui tópicos entre os quais há sinergia. Essa orientação é compatível com a prática da Engenharia de Software e não apenas reconhece, mas também respeita os vínculos entre as suas subáreas. Isso resultou em disciplinas coerentes com a prática da Engenharia de Software.",
            "A Figura abaixo ilustra uma disciplina X qualquer do BES, composta por conteúdo das subáreas A, B e C. Ou seja, o conteúdo de X não está contido estritamente na subárea A, nem tampouco na B ou na C. Em vez disso, reúne e explora a interdependência de conceitos dessas três subáreas.",
            "As subáreas “requisitos” e “projeto de software”, por exemplo, são contempladas em várias disciplinas do curso e não apenas nas disciplinas nas quais são o foco principal de interesse. A disciplina que enfatiza testes, por exemplo, inclui aspectos de design de software e também de requisitos, assim como aqueles de construção de software. De forma resumida, as disciplinas não são uma projeção cartesiana das 15 subáreas de conhecimento da Engenharia de Software [SWECOM 2014]. Em vez disso, são 18 disciplinas cobrindo reiteradamente várias dessas 15 áreas, sendo que uma delas cobre todas as áreas necessárias para a execução de um projeto real de produção de software (p. )."
          ]
        },
        {
          "subtopico": "Articulação entre Teoria e Prática Profissional",
          "detalhe": [
            "O perfil do egresso, definido em outra seção desse documento, exige do egresso o envolvimento com o fazer, com o exercício do conhecimento de Engenharia de Software.",
            "Essa articulação é explicitamente estabelecida por meio da seção “Condições mínimas” definida para cada disciplina de Engenharia de Software. Tais condições, em geral, definem o que o egresso pode fazer, em outras palavras, é capaz de realizar com o conhecimento. Ou seja, o que convencionalmente se limita ao conteúdo, ou teoria, deverá ser exercitado, ou prática, e com um nível bem definido de proficiência.",
            "A disciplina “Prática em Engenharia de Software” (p. ) é um ponto explícito do curso no qual a prática é o elemento principal, perfazendo 320 horas. O fazer, contudo, não está restrito a essa disciplina. A capacidade de realização de atividades de desenvolvimento de software é exigência em boa parte das disciplinas."
          ]
        },
        {
          "subtopico": "Interdisciplinaridade",
          "detalhe": [
            "Produzir software significa, necessariamente, o emprego de pelo menos dois domínios. O domínio da solução, no qual a Engenharia de Software é exercitada e o domínio do problema, que fomenta a existência do software. O domínio do problema é “universal”, pois inclui saúde, educação, segurança, governo, finanças e entretenimento, dentre muitos outros. Fazer software, portanto, por si só, exige o contato com outras áreas do conhecimento.",
            "O acesso a outras áreas pode vir das disciplinas do Núcleo Livre (NL). O BES exige para a integralização curricular pelo menos 128 horas de disciplinas do NL. Essas disciplinas são escolhidas pelo estudante dentre todas aquelas oferecidas na UFG. Para ilustrar, no primeiro semestre de 2015 houve oferta de vagas para mais de 300 disciplinas de NL. Ou seja, o conjunto de opções de outras áreas do conhecimento é rico, o que contribui com uma formação ampla do estudante. Convém destacar que tais 128 horas perfazem a quantidade mínima exigida, o estudante pode fazer uso de uma carga horária maior. O mesmo é válido para o estágio não obrigatório e para as atividades complementares. O estudante deve cumprir um mínimo de 192 horas em atividades complementares.",
            "A interdisciplinaridade estimulada pelos elementos citados acima é extra curso. Aquela intracurso é tratada tanto pela definição das disciplinas quanto pela disciplina “Prática em Engenharia de Software” (p. ). Nesses casos a interdisciplinaridade é compulsória, pois faz parte da própria concepção do curso. Adicionalmente, sem restringir a liberdade metodológica do docente, cabe ao NDE orientar a definição de programas de disciplinas que cultivem a interdisciplinaridade."
          ]
        },
        {
          "subtopico": "Disciplina Pratica em Engenharia de Software",
          "detalhe": [
            "Essa disciplina de 320 horas tem como objetivo explícito a participação do estudante em um ou mais projetos integradores que usufruem de conhecimento e habilidades adquiridos por todo o curso. Os projetos exigem o contato com problemas reais, o que exige contato tanto com o conhecimento quanto profissionais de outras áreas. Consulte detalhes na página ."
          ]
        },
        {
          "subtopico": "Atividades Supervisionadas",
          "detalhe": [
            "De acordo com a Resolução  CNE/CES 03/2007 de 2 de julho de 2007, cabe às Instituições de Educação Superior, respeitando o mínimo dos duzentos dias letivos de trabalho acadêmico efetivo, a definição da duração da atividade acadêmica ou do  trabalho discente efetivo, o que compreende: (a) preleções e aulas expositivas e (b) atividades práticas supervisionadas, tais como laboratórios, atividades em biblioteca, iniciação científica, trabalhos individuais e em grupo, práticas de ensino e outras atividades no caso das licenciaturas.",
            "O BES divide cada hora de atividade acadêmica em 45 minutos de preleções e aulas expositivas e 15 minutos de atividades práticas supervisionadas. O planejamento de cada hora deve estar devidamente registrado no plano de cada disciplina. Em particular, o plano deve incluir de forma clara as atividades práticas supervisionadas."
          ]
        }
      ]
    },
    {
      "topico": "Núcleo Docente Estruturante (NDE)",
      "descricao": [
        "Em vez de atribuir atividades ao NDE, o NDE adota os seguintes princípios:",
        "O NDE possui duas prioridades. A maior prioridade é colocar em prática o Projeto Pedagógico do Curso (PPC). A prioridade seguinte é mantê-lo relevante.",
        "Qualquer questão que diz respeito às prioridades é do interesse do NDE e pode resultar em ação.",
        "Toda ação necessariamente deve gerar valor e estar alinhada com as prioridades.",
        "Uma ação constante e preconcebida é zelar pelos princípios aqui descritos.",
        "O NDE entende que o diálogo é necessário e que a diversidade é natural, assim como o confronto de ideias.",
        "Esses princípios definem que todo o conteúdo do presente PPC e a aplicação dele está no raio de atuação do NDE. O que inclui: ",
        "Acompanhar a execução das ações de ensino, pesquisa e extensão pertinentes ao curso;",
        "Acompanhar a avaliação das ações do curso;",
        "Emitir opinião sobre ações pertinentes ao curso;",
        "Monitorar o desempenho dos estudantes;",
        "Promover ações que possam reduzir reprovações;",
        "Monitorar resultados dos trabalhos de conclusão de curso;",
        "Monitorar ações de estágios dos estudantes do curso;",
        "Acompanhar e se pronunciar acerca de reclamações pertinentes ao curso;",
        "Avaliar de forma contínua o PPC do curso;",
        "Acompanhar e promover a qualificação de docentes;",
        "Acompanhar e promover a qualificação do corpo de técnico-administrativos.",
        "O NDE, portanto, não se apresenta como órgão ou mecanismo deliberativo, mas consultivo. Reúne docentes que continuamente refletem sobre questões pertinentes ao curso e, em consequência, definem ações que assistem, apoiam e fomentam a qualidade do curso, bem como contribuem com a execução dessas ações.",
        "A atuação do NDE deve ser realizada em estreita interação com a coordenação do curso. Entretanto, não é nem pode ser vista como meio para auxiliar a realização de fluxos administrativos (atribuição da coordenação do curso). ",
        "Convém observar que as atribuições estabelecidas acima estão em conformidade com a resolução da Comissão Nacional de Avaliação da Educação Superior (CONAES), 01/2010 de 17 de junho de 2010, a qual “normatiza o núcleo docente estruturante”, e esclarecido pelo parecer CONAES 04/2010 de 17 de junho de 2010. "
      ],
      "conteudo": [{
        "subtopico": "",
        "detalhe": ""
      }]
    },
    {
      "topico": "Política e gestão de estágio não obrigatório",
      "descricao": [
        "O estágio do BES constitui-se em um mecanismo de complementação de conhecimento e aperfeiçoamento de habilidades, além de oportunidade de prática em Engenharia de Software. O convívio com profissionais, obrigações, hierarquias e processos onde o estágio se desenvolve, resulta em oportunidade valiosa para a formação profissional do egresso. ",
        "O estágio do BES não é de caráter obrigatório, ficando a critério do estudante realizá-lo ou não, desde que o mesmo esteja regularmente matriculado no curso. Ou seja, caracteriza estágio curricular não obrigatório. Adicionalmente, esse estágio deve ser realizado a partir do terceiro período do curso, ou após a conclusão de pelo menos 640 horas da carga horária do curso.",
        "Convém observar que o estágio está restrito às empresas devidamente conveniadas com a UFG ou que se utilizam de agentes de integração conveniados. Adicionalmente, dois outros papéis são obrigatórios no estágio: (a) supervisor (no local do estágio) e (b) orientador (professor do curso).",
        "Durante o estágio, que não pode ultrapassar 24 meses em mesmo local, o estudante deverá apresentar o Termo de Compromisso, o Plano de Estágio, além da frequência e dos relatórios semestrais.",
        "Os documentos citados acima, bem como outros detalhes do estágio, em conformidade com a Lei 11.788/2008, são definidos pelo Regulamento de Estágio de Curso do Bacharelado em Engenharia de Software."
      ]
    },
    {
      "topico": "Trabalho de Conclusão de Curso (TCC)",
      "descricao": [
        "O Trabalho de Conclusão de Curso (TCC) no BES é um componente curricular obrigatório regulado pelas Normas e Procedimentos de Trabalho de Conclusão de Curso do Bacharelado em Engenharia de Software.",
        "O TCC é desenvolvido na última etapa da graduação, sob a orientação de um professor e compreende um relatório e uma apresentação.",
        "O relatório é individual e tem como objetivo a expressão do estudante na forma escrita, a capacidade de analisar, caracterizar, investigar, discutir, implantar, pesquisar, realizar, sintetizar e avaliar, entre outras. Neste sentido, o relatório descreve, de forma crítica, as atividades teórico-práticas e de formação profissional relacionadas ao desenvolvimento do estudante como profissional, em especial, durante a disciplina Prática em Engenharia de Software (p. ). ",
        "A apresentação do relatório, também individual, é realizada como última atividade do curso e tem como objetivo a expressão do estudante, agora na forma oral, das atividades descritas no relatório, em seção pública e para uma banca formada por professores do INF. A banca de professores tem o direito a um período de arguição e é responsável pela avaliação tanto do relatório quanto da apresentação."

      ]
    },
    {
      "topico": "Integração ensino, pesquisa e extensão",
      "descricao": [
        "A integração do ensino com a pesquisa e a extensão se verifica por meio de atividades complementares, do estágio não obrigatório, de disciplinas do curso e da postura didática dos docentes, conforme comentado abaixo. ",
        "As atividades complementares são identificadas em resolução própria, perfazem pelo menos 192 horas e explicitamente incluem ações de extensão e de pesquisa. Por exemplo, divulgação de trabalhos em eventos científicos, participação em projetos de extensão e participação em projetos de pesquisa, dentre outras.",
        "O estágio não obrigatório é um instrumento de integração. As atividades a serem realizadas pelo estudante podem incluir ações de pesquisa.",
        "A disciplina Metodologia e Experimentação em Engenharia de Software oferece a visão exigida para a realização de pesquisas na área. Isso significa não apenas orientar o estudante acerca da elaboração de uma revisão sistemática, mas também da necessidade da expansão do conhecimento da área e dos mecanismos atualmente empregados para tal. ",
        "Um contundente exemplo é a disciplina de 320 horas, Prática em Engenharia de Software. Essa disciplina envolve em sua concepção o ensino, a extensão e a pesquisa ao se concentrar em projetos reais executados no ambiente de uma Fábrica de Software. Qualquer que seja o projeto, esse envolverá extensão e/ou pesquisa, naturalmente, ainda em um cenário de aprendizado (ensino).",
        "A integração, contudo, não ocorre apenas por meio dos elementos acima, que seriam pontos de integração localizados e em períodos específicos. A integração deve ocorrer, onde oportuno, em cada ação do curso. Por exemplo, uma postura didática recomendável exige a contextualização de cada aula acerca do que será visto, da repercussão ou relação dela com a indústria de software (sociedade) e do estado da arte corrente. De fato, essa postura não é apenas recomendável, mas exigida por meio das “condições mínimas” definidas para cada disciplina. Ou seja, a integração do ensino com a pesquisa e a extensão ocorre por toda a extensão do curso. "
      ],
      "conteudo": [{
        "subtopico": "",
        "detalhe": ""
      }]
    },
    {
      "topico": "Avaliação do processo de ensino e aprendizagem",
      "descricao": [
        "O que é realizado em nome do curso para que o estudante adquira o perfil esperado pode ser avaliado considerando informações geradas externamente e outras internamente. A avaliação do curso pelo MEC e os resultados obtidos pelos estudantes do curso no ENADE são exemplos de insumos para a avaliação do processo de ensino. Internamente, a avaliação do docente pelo discente (instrumento formal e institucionalizado na UFG), o desempenho dos estudantes do curso nas disciplinas e os planos de ensino das disciplinas são fontes valiosas de informação. ",
        "O NDE do curso é o principal consumidor dessas informações com o propósito de detectar possíveis melhorias e fomentar a introdução delas. Por exemplo, embora o docente tenha autonomia metodológica ao planejar e executar o plano de ensino de uma disciplina, cabe ao NDE analisar o plano e, quando considerar oportuno, recomendar ajustes. Essas e outras ações devem ser realizadas durante a semana de planejamento pedagógico e administrativo (semana formalmente institucionalizada na UFG), que ocorre no início de cada período letivo. Convém destacar que o plano de ensino de cada disciplina deve ser aprovado formalmente pelo Conselho Diretor da unidade antes do início do período letivo. Adicionalmente, a ação de avaliação não deve estar restrita à semana de planejamento, mas contínua. O objetivo é viabilizar a introdução de uma eventual mudança o mais próximo possível do instante no qual a necessidade foi detectada.",
        "Outra ação relevante do NDE na semana de planejamento pedagógico é apresentar as lições aprendidas no período anterior. Oferecer visibilidade de processos de ensino exitosos, o que é um instrumento de valorização do docente e, ao mesmo tempo, forma de socializar o que produziu bons resultados, também é uma ação a ser executada nessa semana. Enfim, acerca da avaliação do processo de ensino, o NDE possui papel relevante na identificação de dificuldades e busca de alternativas, em comunhão com os docentes do curso.",
        "A avaliação do processo de ensino, da aprendizagem e do curso, dentre outros, são assuntos pertinentes ao NDE (p. ). De fato, são interconectados. Em vez de estabelecer ações específicas no presente PPC, são fornecidos princípios adotados pelo NDE do curso (p. ). Ou seja, orientar os estudantes do curso a cada início do período letivo acerca das normas da UFG, de prazos, da meta de integralização curricular de cada um deles, são algumas ações relevantes, tendo em vista tais princípios.",
        "A avaliação da aprendizagem pode ser materializada de várias formas. São comuns avaliações (provas) escritas e individuais, a avaliação por meio de relatórios ou trabalhos escritos e apresentações orais, dentre outras. A avaliação contínua por meio de exercícios realizados ao longo de toda uma disciplina também é uma forma. De fato, vale ressaltar que um método adequado de avaliação em um cenário não o é em outro. ",
        "A avaliação do processo de ensino e aprendizagem do BES deve atender, no seu planejamento e na forma contínua de sua execução, o estipulado pelo Regulamento Geral dos Cursos de Graduação (RGCG) da UFG [CEPEC 2012], notadamente em seu Capítulo IV, Seção 1 - “Da verificação da Aprendizagem”.",
        "Cabe ressaltar que o Sistema de Avaliação do BES tem como objetivo primeiro de sua aplicação, por meio de sua Estrutura Curricular (p. ), utilizando instrumentos pedagógicos norteados pelos Princípios Norteadores (p. ), permitir que cada estudante adquira o perfil desejado (p. ).",
        "A avaliação do estudante deve levar em consideração não apenas o atendimento de requisitos técnicos de produtos e processos das diversas disciplinas da Engenharia de Software, mas também demonstrar postura ética e profissional ao desenvolver ações do curso. ",
        "Convém destacar que as disciplinas específicas de Engenharia de Software são acompanhadas, cada uma delas, de seção de “Condições mínimas” (p. ), que identificam elementos obrigatórios a serem satisfeitos pelo estudante para ser considerado aprovado na disciplina. Embora essa seja uma interpretação correta, a intenção é estabelecer um contrato claro do compromisso do estudante e do docente com a disciplina em questão. A avaliação de cada uma dessas disciplinas, portanto, necessariamente deve observar as condições mínimas estabelecidas. De fato, a condução de toda a disciplina deve ser orientada por tais condições.",
        "Dada a especificidade da disciplina “Prática em Engenharia de Software” (p. ), o sistema de avaliação também é específico. Nesse caso, as avaliações devem envolver o domínio de processos e a geração de produtos de Engenharia de Software. Em particular, atividades avaliativas podem ser realizadas mesclando teoria e prática em um ambiente real de desenvolvimento de software, no qual a qualidade estabelecida para os entregáveis do projeto em questão é verificada."
      ],
      "conteudo": [{
        "subtopico": "",
        "detalhe": ""
      }]
    },
    {
      "topico": "Avaliação do projeto de curso",
      "descricao": [
        "O presente PPC deverá ser revisado formalmente de cinco em cinco anos, em ação proativa, ou em intervalo de tempo menor, na ocorrência de evento que justifique tal decisão.",
        "O NDE é responsável pelas revisões do PPC e, em particular, por contínua vigilância da adequação do PPC ao cenário corrente. Esse esforço se realizada de duas formas. Uma no sentido de fazer com que as orientações do PPC sejam observadas no cotidiano do curso e outra, onde considerado oportuno, na análise de possíveis melhorias para reagir adequadamente às mudanças do ambiente.",
        "Ao acompanhar o curso, o NDE continuamente coleta, detecta e propõe alterações. As demandas podem se originar dos estudantes, dos docentes e de outras fontes como os resultados dos estudantes do curso no Exame Nacional de Desempenho de Estudantes (ENADE)."
      ],
      "conteudo": [{
        "subtopico": "",
        "detalhe": ""
      }]
    },
    {
      "topico": "Política de qualificação",
      "descricao": [
        "Desde a criação o Instituto de Informática implementa uma política vigorosa de capacitação do seu corpo docente, a qual inclui a meta de que todos os docentes tenham a titulação mínima de doutor. De fato, a liberação de docentes para prosseguirem os seus estudos de pós-graduação é uma prática comum, em consequência, nenhum pedido para afastamento com o propósito de realizar o doutorado foi negado até o momento. Essa política é acrescentada de regras institucionalizadas para a concessão de afastamento para o pós-doutorado e de licença para capacitação.",
        "A qualificação de docentes do INF também pode ser obtida pela sua participação em congressos, simpósios, dentre outros eventos, quer seja nos papéis de autor de artigo, organizador de evento, membro de comitê de programa ou avaliador de artigo. O Instituto de Informática ainda financia ou co-financia viagens e inscrições de seus docentes em congressos e simpósios importantes, principalmente quando há publicação de artigo.",
        "Em harmonia com a política de capacitação docente, o INF é favorável ao aprimoramento e à capacitação de seu corpo Técnico-Administrativo em Educação (TAE). Normalmente, um TAE faz solicitação ao diretor, encarregado de registrar as intenções de afastamento no plano anual de capacitação e conduzir a apreciação das intenções pelo Conselho Diretor do INF, haja vista que é do interesse da unidade fomentar a especialização e capacitação dos seus profissionais. ",
        "É frequente a liberação das atividades de TAE para que possam participar de treinamentos, tanto em cursos esporádicos quanto em programas de pós-graduação. Em tempo, as ações de extensão do INF reservam vagas exclusivas para participação de TAEs, sem necessidade de pagamento (quando é o caso).",
        "Do ponto de vista legal, o INF se apoia na Resolução CEPEC 1286/2014 de 2014 [CEPEC 2014], que regulamenta o afastamento de docentes para cursar Mestrado, Doutorado e estágios Pós-Doutorais, e na Resolução CONSUNI 02/2014 [CONSUNI 2014], que regulamenta o Programa de Capacitação e o Plano Anual de Capacitação dos TAEs. Em consonância com a Resolução CEPEC 1286/2014, o INF instrui o afastamento de docentes com a Resolução CD/INF n. 01 de 2014, que dá suporte ao planejamento administrativo e incentiva a participação de seus docentes, em cursos de doutorado, pós-doutorado e capacitação, no país e no exterior, de acordo com a sua política de pessoal para o ensino, a pesquisa, a extensão e a administração.",
        "Por fim, cabe ao NDE monitorar o PPC e, consequentemente, promover ações que promovam a qualidade dos serviços oferecidos tanto por docentes quanto por TAEs."
      ],
      "conteudo": [{
        "subtopico": "",
        "detalhe": ""
      }]
    },
    {
      "topico": "Requisitos legais e normativos",
      "descricao": "",
      "conteudo": [{
        "subtopico": "Libras",
        "detalhe": [
          "O Decreto 5.626/2005 regulamenta a Lei 10.436, de 24 de abril de 2002, e o artigo 18 da Lei 10.098, de 19 de dezembro de 2000. Segundo esse Decreto, a disciplina curricular Libras é obrigatória para vários cursos, dentre eles, as licenciaturas e os cursos de Fonoaudiologia. O Decreto também estabelece que, nos demais cursos, a disciplina curricular Libras seja optativa, conforme o Capítulo II, § 2º: “a Libras constituir-se-á em disciplina curricular optativa nos demais cursos de educação superior”.",
          "Em atenção a tal requisito legal, o Bacharelado em Engenharia de Software inclui a disciplina Libras como optativa, no oitavo período do curso."
        ]
      },
        {
          "subtopico": "Política de educação ambiental",
          "detalhe": [
            "A Lei 9.795, de 27 de abril de 1999, institui a Política Nacional de Educação Ambiental, que é regulamentada pelo Decreto 4.281, de 25 de junho de 2002. Conforme essa Lei, Seção II, Art. 10, “a educação ambiental será desenvolvida como uma prática educativa integrada, contínua e permanente em todos os níveis e modalidades do ensino formal”. Adicionalmente, lê-se na Seção II, Art. 10, § 1º: “a educação ambiental não deve ser implantada como disciplina específica no currículo de ensino”. O destaque (negrito) é do presente documento. ",
            "O Bacharelado em Engenharia de Software trata a Educação Ambiental por duas linhas contínuas de atuação: uma delas baseada no planejamento das disciplinas e outra em programa institucional do Instituto de Informática, ambas comentadas abaixo."
          ]
        },
        {
          "subtopico": "Planejamento das disciplinas",
          "detalhe": [
            "O planejamento de cada turma deve se inspirar em possíveis estratégias de inserção de questões ambientais. Por exemplo, adoção de material em formato digital em vez de formato impresso.",
            "A apresentação do conteúdo de cada disciplina também pode se beneficiar do volume significativo de dados sobre o meio ambiente. Por exemplo, área desmatada ao longo do tempo; áreas de preservação; consumo de energia; emissão de CO2; qualidade do ar; consumo de materiais poluentes e geração de lixo eletrônico. Tais dados podem ser empregados para ilustrar o funcionamento de algoritmos e visualização de informações, dentre outras possibilidades. ",
            "Convém destacar que esses exemplos devem ser vistos como elementos de inspiração, a serem renovados continuamente."
          ]
        },
        {
          "subtopico": "Programa institucional",
          "detalhe": [
            "A UFG executa um Plano de Logística Sustentável (PLS), que estabelece práticas de sustentabilidade e racionalização de gastos e processos na administração pública [PLS]. Esse plano é internalizado no Instituto de Informática por um Programa Institucional de extensão. ",
            "O PLS une o cotidiano da prática acadêmica com atitudes “sustentáveis” por meio de recomendações simples, como a impressão em ambos os lados de uma folha e a redução do uso de copos descartáveis, dentre muitas outras.",
            "O Programa Institucional reúne ações que contemplam as orientações do PLS. O objetivo é colocar em prática essas orientações. Por exemplo, enquanto o PLS sugere a coleta seletiva, esse programa cria um repositório para coleta de pilhas e baterias já utilizadas, além de assegurar que aquele material coletado será descartado de forma correta.",
            "O Programa Institucional possui objetivos e ações que incluem a educação ambiental. As opções de ações variam. Dentre elas uma é constante: avaliação dos resultados. Dentre as demais:",
            "Cursos de extensão cuja inscrição seja lixo eletrônico;",
            "Elaboração de material de conscientização sobre consumo parcimonioso de água e energia;",
            "Palestras e cursos sobre TI Verde (green computing);",
            "Pesquisa sobre consumo de energia por datacenters;",
            "Divulgação e destaque de informações sobre o meio ambiente;",
            "Monitoramento e divulgação de informações ambientes sobre Goiás;",
            "Divulgação de softwares que promovem o meio ambiente, por exemplo, evitam deslocamentos, evitam consumo de energia."
          ]
        },
        {
          "subtopico": "Resolução Nº 1 de 17 de junho de 2004",
          "detalhe": [
            "A Resolução Nº 1, de 17 de junho de 2004, trata das Diretrizes Curriculares Nacionais para a Educação das Relações Étnico-Raciais e para o Ensino de História e Cultura Afro-Brasileira e Africana. ",
            "O objetivo é claro: “combater o racismo e as discriminações que atingem particularmente os negros. Nessa perspectiva, propõe a divulgação e produção de conhecimentos, a formação de atitudes, posturas e valores que eduquem cidadãos orgulhosos de seu pertencimento étnico-racial, descendentes de africanos, povos indígenas, descendentes de europeus, de asiáticos. ”",
            "Tal objetivo pressupõe a “adoção de políticas educacionais e de estratégias pedagógicas de valorização da diversidade”, conforme consta na Resolução, assim como os princípios a serem observados para atendê-la: (a) consciência política e histórica da diversidade; (b) fortalecimento de identidades e de direitos e (c) ações educativas de combate ao racismo e a discriminações.",
            "O Art. 7.º da Resolução ainda destaca: “as instituições de ensino superior, respeitada a autonomia que lhe é devida, incluirão nos conteúdos de disciplinas e atividades curriculares dos diferentes cursos que ministram, a Educação das Relações Étnico-Raciais, bem como o tratamento de questões e temáticas que dizem respeito aos afrodescendentes. ”",
            "Tendo em vista o requisito legal estabelecido pela Resolução, duas linhas de atuação são adotadas pelo Bacharelado em Engenharia de Software: inserção de conteúdo pertinente em duas disciplinas curriculares obrigatórias e o Programa Institucional de extensão do Instituto de Informática. Ambas comentadas abaixo."
          ]
        },
        {
          "subtopico": "Disciplinas de graduação obrigatórias",
          "detalhe": [
            "As disciplinas “Computador e Sociedade” (p. ) e “Interação Humano-Computador” (p. ) incluem, em seus ementários, tópicos pertinentes às exigências da Resolução. Em particular, remetem para o conhecimento de questões pertinentes ao continente africano e para o conhecimento e respeito à diversidade."
          ]
        },
        {
          "subtopico": "Programa institucional",
          "detalhe": [
            "O Programa Institucional de extensão do Instituto de Informática será realizado por meio de ações, boa parte com ênfase na socialização de conhecimento sobre questões pertinentes à formação dos brasileiros, o que invariavelmente inclui os negros e indígenas. Esse conhecimento é indispensável para a promoção da diversidade, do respeito às diferenças e da igualdade independente das crenças, do sexo, da idade, da cor, da condição social. ",
            "O Instituto de Informática, por meio desse programa de extensão, dedicado exclusivamente às relações étnico-raciais e ao meio ambiente, oferece atuação contínua sobre esses tópicos, durante toda a permanência dos seus estudantes nessa unidade, sejam de graduação ou pós-graduação. ",
            "Especificamente sobre questões de cunho étnico-racial, sem a intenção de ser uma apresentação exaustiva, nem restritiva, são identificadas algumas ações possíveis:",
            "Ações afirmativas por meio de cursos de extensão.",
            "Ações para promoção da diversidade",
            "Palestras sobre a construção de uma sociedade justa.",
            "Palestras sobre a diversidade da formação dos brasileiros.",
            "Palestras sobre a história afro-brasileira, sobre a história africana.",
            "Palestras sobre os povos indígenas.",
            "Apresentações artísticas que valorizem a cultura africana e indígena."
          ]
        },
        {
          "subtopico": "Diretrizes nacionais para Educação em Direitos Humanos",
          "detalhe": [
            "A disciplina “Computador e Sociedade” (p. ) trata questões relevantes acerca de direitos humanos: aspectos profissionais; participação de mulheres na computação e evolução de aplicações com acessibilidade, dentre outras, nas quais os direitos humanos precisam de discussões mais aprofundadas na computação. Na disciplina “Interação Humano-Computador” (p. ) as características humanísticas, culturais, de direitos humanos e de aspectos políticos serão abordados em mais profundidade."
          ]
        },
        {
          "subtopico": "Proteção dos direitos da pessoa com Transtornos do Espectro Autista",
          "detalhe": [
            "A proteção dos direitos da pessoa com transtorno do espectro autista é fundamentada na Lei N.º 12.764 de 27 de dezembro de 2012, que institui a política nacional de proteção dos direitos da pessoa com transtorno do espectro autista, e altera o § 3.º do Art. 98 da Lei N.º 8.112, de 11 de dezembro de 1990. Esse requisito legal é atendido por meio da disciplina obrigatória “Interação Humano-Computador”, que inclui em seu ementário tópicos pertinentes ao tratamento de características humanísticas e biológicas na construção de interfaces de usuário, o que possibilita a socializar informações relevantes para que portadores do Transtorno do Espectro Autista possam ser adequadamente considerados por meio de suas necessidades especiais."
          ]
        }
      ]
    }
  ]
}
